[{"id":133,"title":"Park and looking for birds","date_start":"2024-05-06","date_end":"2024-05-06","day_of_week_start":"","day_of_week_end":"","text":"- Nice weather before it gets rainy again\r\n- went to Strawbery park, and waled all full lenght.\r\n- found some feathers\r\n- a lot of wildlife: birds, turtles, bird eggs, bird in the nest on the tree\r\n- Betted how far is the car from where were on the way back\r\n- I ended up driving\r\n- Took binoculars to see birds, and I think they have enough magnification for birding. I was thinking getting a spotting scope to take pictures of birds since it is more budget option. Camera lenses are way too expensive. Was looking for spotting scope as well too see wildlife as well. Might change my mind because need to get a tripod with a spotting scope as well. It is too heavy and unstable to use it by itself","tags":""},{"id":132,"title":"Visiting Sandy's manager in pa","date_start":"2024-05-03","date_end":"2024-05-03","day_of_week_start":"","day_of_week_end":"","text":"- Plov from fire","tags":""},{"id":131,"title":"continiue oreoaring for CKAD","date_start":"2024-05-04","date_end":"2024-05-04","day_of_week_start":"","day_of_week_end":"","text":"- raining all weekend long so staying in\r\n- preparing for CKAD, but still can't get mock exam to pass\r\n- probably will take it once I get passing grade\r\n- too bad that mock exams don't offer partial credit","tags":""},{"id":130,"title":"Visiting suggested gardens","date_start":"2024-04-27","date_end":"2024-04-28","day_of_week_start":"","day_of_week_end":"","text":"- Border park walk\r\n- Wanted to go to park, but longwood was all booked up\r\n- went to Winterhur insstead, as heard people from the hike go\r\n- lunch\r\n- a lot of flowers, looks almost fake\r\n- unexpectedly went to museum\r\n- lunch bring with us\r\n- a lot of bugs\r\n- a lot of hills going up and down\r\n- walked 5 miles total\r\n- was getting a bit hot\r\n- tea might be too hot for this weather","tags":""},{"id":129,"title":"Sandy is back","date_start":"2024-04-24","date_end":"2024-04-24","day_of_week_start":"","day_of_week_end":"","text":"- Sandy is coming back  today and need to pick her up from JFK today. Clean up the house a bit to get ready for her. Her flight was delayed so had a little bit of time for work and prepare a house. Didn't have to rush at all.\r\n- Going  there was not too bad. Only got yelled by some truck driver because I didn't move fast enough when 4 lanes merged into one after the toll booth. \r\n- I arrived a bit early so stayed a parking lot near the beach. It has a older row boat washed almost to the shore. Took some pictures of that and went back to the car since the beach it was a bit dirty and cold.\r\n- Picking up Sandy was pretty easy. The air port was not too busy, but there was a lot of people picking up people. Luckily Sandy saw my car and I saw her so picked her up pretty easily.\r\n- Going back was easy as well, but Sandy put a longer route to get home. However, I kinda knew where I was so I turned around and went the correct way, the way I came over. Arrived a bit late so didn't have time to get dinner.","tags":""},{"id":128,"title":"Break neck ridge hike with shortcut","date_start":"2024-04-20","date_end":"2024-04-20","day_of_week_start":"","day_of_week_end":"","text":"- Anvar joked that parking was almost full\r\n- Diana was late..again but not too bad\r\n- Short cut instead of doing a scramble, still need to do scramble a bit. Took shorter path. Anvar had to push dogs up the rocks. He went the harder way in the beginning, but had to go backtrack and go the easier way that the rest of the group went. \r\n- Trekking poles going downhill definitely helped, going down was little bit steep. \r\n- Interesting rocks at the trail. A lot of them are metamorphic rocks such as ghenesis. Don't see a lot of sand stone as other mountains around here. Maybe because the mountain is by the river and the sand stone was eroded away.  Found some coal at the trail for some reason at the trail.  \r\n- Some person brought a cake that shared with us\r\n- Before going uphill we took a small break and a big group passed us. We started to hike soon after and then we passed them, so we arrived to the top first and we occupied the overlook first. The other people we waiting for us to leave. \r\n- Dog started to eat my sandwich when we stopped at the rock. I was laying on the rock and Anvar's dog was started to sniff my backpack and I figured out that it was trying to get my sandwich that was in my backpack outside pocket.\r\n- was looking to put hammock at the break, but there were not a good place to it if I wanted to be close to people.\r\n- Elnaras son failed school joined Army Guard. Like me he also told about it the last minute. The way she described and complained was similar to my situation so I just walked forward of her talking. The son had an ultimatum to join US Army or Arjebazan army.","tags":""},{"id":127,"title":"Wrist pain hurt","date_start":"2024-04-20","date_end":"2024-04-21","day_of_week_start":"","day_of_week_end":"","text":"- Wrist pain in both hands from typing too much. I had a slight pain/soreness earlier this week, but it got better since I put a towel as a wrist rest for a keyboard, but I had been typing too much in preparation to my CKAD exam. I think I do too much wrist flexion. On Sunday was researching if getting ergonomic keyboard will help me. Sunday night was researching this topic and it took me a while to get to sleep. Decided to get a split keyboard.\r\n- Next day tried to use low profile/provided by a company keyboard. It worked a bit and was not feeling as much soreness at the end of the day. Maybe that my keyboard was too high was causing m problems?\r\n- The rest of the week tried not too type as much and the paint/soreness seem to get less and less over the time.","tags":""},{"id":126,"title":"Easy non political hike, but people didn't show up","date_start":"2024-04-13","date_end":"2024-04-13","day_of_week_start":"","day_of_week_end":"","text":"- This week decided to go to local forest and then have an after party at my place. Ruslan was supposed to join us, but he had to do some other stuff. He said that he is planning to move, and he needs time to prepare for it. Diana was supposed to join us as well, but she hiked with Anvar the day prior and she injured herself and not able to join us as well. So no more coming over to my place after the hike. \r\n- Joked at the beginning of the hike that we are not supposed to talk about politics during the hike since last time one of the person was talking about it too much and started to argue with people during the lunch. However, people started talking about politics after all. How elections are going to be and who vote for. At the end of the hike Sergey and other  person was debating how WWII came to life and what happened with Finland after WWII\r\n- Took a break at the gazebo. It is nice resting location since we had a big table that can fit everyone and we stayed there for a while just talking and not doing much.\r\n- It was getting hot today even when hiking on flat surface. Soon we will need to start hike early in the morning to avoid  the heat.\r\n- Mostly talked with Yakov since the other people talked about politics and I and Dimka had not a lot to contribute to conversation. He and his wife went to Olympia national park so I asked  him some questions about his trip since we are planning to there\r\n- The end of the hike went to white trail where additional lakes. The trail was washed up and some people were hesitant to continue to go since the wood that was to cross stream was slightly under the water. I decided to take my shoes off since we are just going to walk a little and water should be nice and cold. It was nice walking on the sand for a little bit and crossing the stream such that Dimka also took his shoes off when crossing the stream on the way back.\r\n- There were some new people in our group that are new to hiking/don't hike as much. So they were sligtly complaining that we took a detour to see lakes\r\n- Saw that plant that eats animals. Yakov pointed out how it supposed to look like.\r\n- Decided to eat ramen again. Dimka is liking that place a lot","tags":""},{"id":125,"title":"Going to park since it been nice outside","date_start":"2024-04-12","date_end":"2024-04-12","day_of_week_start":"","day_of_week_end":"","text":"- going to boundary park after work to get some pictures of flowering trees. Didn't have a chance to do it earlier since it been raining or too cold. The trees are still not in full bloom yet. Last year the same time there were in full bloom already. Cherry/apple just started to bloom and there are still some green buds from tree that have flowers growing from the bark.","tags":""},{"id":124,"title":"First day eating outside","date_start":"2024-04-09","date_end":"2024-04-09","day_of_week_start":"","day_of_week_end":"","text":"It is finally been warm outside so I could eat lunch on the patio. The table was a good purchase. Definitely enjoying extra sunshine.","tags":""},{"id":123,"title":"Long hike in Delaware water gap","date_start":"2024-04-06","date_end":"2024-04-06","day_of_week_start":"","day_of_week_end":"","text":"- This weekend gong to delaware water gap for a hike. Started early, so had to get up a little bit than usual\r\n- Sveta pulled out snow car brush instead of hiking pole and he was getting out her trecking pole from Dimka's car\r\n- Ilgiz joined us, but he was struggling going uphill with us. He was going in the last. Maybe about an mile in, he decided to go back. He was out of shape to catch up with us and he haven't done any execsises for a long time\r\n- There was a lot of water on the trail since it been raining previous days. I was wearing trail runners and thicker socks and was afraid that I would get my shoes wet. At the beginning of the train I though that I should have worn hiking boots, but at the end of the hike realized that I made a correct decisions. It was getting too warm to wear hiking boots by the end of the hike. Because there was a lot of rain before, some of the waterfalls and streams were full of water. We decided to go on the ridge line trail instead of stream since we were afraid that the trail would be flooded.\r\n- Stopped at the lake for out lunch break. I forgot to bring titanium cup for tea, so I used coffee cup instead. Dimka forgot his tea, so I gave some of mine. \r\n- There was some snow at the trail so we made a snow man. The snow was on the north facing slope. \r\n- Going last uphill and downhill was a tiring. We are at 10 miles mark already. Had to stop a bit when going uphill. \r\n- After the hike got pizza and ate it at my place with Dimka","tags":""},{"id":122,"title":"Sandy is gone and convinient hike","date_start":"2024-03-29","date_end":"2024-03-29","day_of_week_start":"","day_of_week_end":"","text":"- Sandy is leaving to China for several weeks. Drove her to the air port after the week. The traffic was not too bad going to NYC.There was no traffic at air port either\r\n\r\n- The next day week to hike with Dimka. It was was his bday and good timing for Sandy to leave so I can see him. Went to Lehigh Valley hike where people gave up going uphill several times\r\n- Roma invited his gf to the hike. But I think shed didn't enjoy it too much. She was struggling going uphill a bit. And by the time we finished, they peeled off from the group and left without saying that they are leaving\r\n- Took the same picture at the rocks with roma and dimka like 2 years and as joke to send Ruslan since he decided not to go to a hike. Ruslan is thinking moving to North Caroline. We joked that he wants go there because Pasha is living there\r\n- Trying to makes some small talk conversation with people\r\n- It was kinda chilly when were sitting on the top of the mountain plus it was a lot of wind, so we had to find a small spot to sit down. Diana had to ask me for my jacket. \r\n- Going back, people thought it was trail when it wasn't, so people started to bushwack. We had to go straigh, but people decided to turn. there were some marks on the trees, but they werent the marks for the trail. I decided to continue since the trail was just there, and other people went the correct way. Sat on the rock a bit while waiting for people to show up.\r\n- One of the people felt when crossing the small rocks. Luckuly she felt on her backapack and we not injured\r\n- Saw some people hiking Appalachian trail. They are doing the the entire trail, they had a tag on their backpack. I think they are doing it section by section since it we are half way in the trail and some people only just starting to hike. Say a beer can on trail. I assume it is for people who are hiking.","tags":""},{"id":121,"title":"Hike by ourselver to waterfall, to early to hike with Anvar","date_start":"2024-03-23","date_end":"2024-03-23","day_of_week_start":"","day_of_week_end":"","text":"- Anvar is organizing a hike in delaware water gap where he would make plov like last year\r\n- His hike is at 10, but it was too early for Sandy to wake up so decided to go for our own hike\r\n- Decided to go to buttermilk falls since it rained previous day\r\n- Was cold a bit at the start of the hike, saw some ice on ponds\r\n- Glad that had gloves with me and so Sandy\r\n- Was walking by a lake by a bit, but decided to go into forest to get away from the wind\r\n- Sandy is now good with bushwhacking. There was a puddle all over the trail, and had bushwack a bit. She had difficulty figuring out the way to go.\r\n- Found some ruins next to the lake that didn't see before. It was interesting adventure and find\r\n- Going to to lake using unification trail. Noticed that there used to be a road here and some electricity poles\r\n- First part of going to waterfall was pretty steep, and we were glad that we don't have to go the same way again. There was some ice on rocks so we had to walk around it\r\n- Had a nice lunch at the waterfall. It was pretty chilly sitting down and we had to wear all out layers. The blanket came in hand to covering our legs. Had some fancy cheese, fancy bread for lunch. The bod for candy was the perfect size for carrying our food. Decided to boil water instead of carrying water bottle since water bottle doesn't keep water as warm as it used to.\r\n- Going up was a bit of a challenge. Sandy was almost crying internally. It a challenging uphill, at the end my legs were feeling it a bit. I tried to run up the hill and got the cramp in my quad at the end\r\n- At the end of our hike we saw a beaver near its hut. Used monocular to look at it, but it was too far too see, but it was cool anyways. \r\n- Finished the hike almost the time it got dark. The sun was setting and the time we were driving out the sun was setting in behind the mountains. I wanted to go to overlook and see the sunset, but the time I went to see it. The sun was already down.\r\n- At the end of the hike were a bit hungry. Were talking about going to hot dog place on the way there. Aparently it is very popular and it  has a lot of people all the time. Went there just in time it was closing. Maybe 15 minutes before closing time, and I wanted to skip it, but Sandy persisted that we go. Standed on the door mat while people mopped the floor. At least we got some energy into us. We had some beech beer as a drink. It was not too bad, but Sandy was not too keen about it since for her it tasted like a medicine.","tags":""},{"id":120,"title":"Political dinner after hike","date_start":"2024-03-16","date_end":"2024-03-16","day_of_week_start":"","day_of_week_end":"","text":"- going to hike in pinebarents with a group and Sandy\r\n- talking to Diana and Dimka again\r\n- the bird that we saw is a turkey vulture\r\n- saw a snapping turtle, good thing have a monoclular\r\n- glad to talk to other people, but didn't want to leave Sandy by herself \r\n- arguing about politics after the hike  at dinner\r\n- people arguing about israel and politics","tags":""},{"id":119,"title":"Walking aroung Morristown","date_start":"2024-03-09","date_end":"2024-03-10","day_of_week_start":"","day_of_week_end":"","text":"- Not doing a lot this weekend\r\n- Walked in Moristown a bit, but it was windy a bit, so not a lot of people were walking around\r\n- A lot of old building \r\n- Almost started to rain/snow, but decided to go strawberry bridge park anyways\r\n- Fist stop where statues and gazebo, decided go drive to the next spot since end of the park is 1.5 miles away one way\r\n- Found a murder scene of a bird, so got some feathers for myself\r\n- The second part of the park was, my favorite place in the park where i usually go and take pictures\r\n- Some cherry started to bloom, so will have to revisit this park or other park soon to take pictures\r\n- Apple trees started to bloom as well, so need to take advantage of time to take pictures of them","tags":""},{"id":118,"title":"Frogs matings hike","date_start":"2024-03-01","date_end":"2024-03-03","day_of_week_start":"Friday","day_of_week_end":"Sunday","text":"- Sandy is back from her trip\r\n- Got upset that made a mess and didn't clean up kitchen when she came back\r\n- Was crying about it little and saying that she is concerned about out relationship\r\n\r\n- Went to park near the Princeton\r\n- easy hike overall\r\n- when approaching pipeline heard a lot of noises like a warning alarms\r\n- when got to pipeline, went to investigate\r\n- it was frogs mating calls, sounds very unnatural and loud because there are too many of them\r\n- saw frog eggs for first time and frogs mating on each other\r\n- reading up of frogs breeding habbits while hike\r\n- the remaining of the trail was very muddy\r\n- at some point gave up with keeping shoes clean and at the end of trail wash my shoes in the stream\r\n- had extra socks that could change int\r\n- mexican food after the hike, the same one that we went long time ago after the same hike","tags":""},{"id":117,"title":"Trying out hammock","date_start":"2024-02-24","date_end":"2024-02-24","day_of_week_start":"Saturday","day_of_week_end":"Sunday","text":"- Raconcas park, the other side that never been\r\n- looks nicer than other side\r\n- saw abandoned buildings and made a hike shorter\r\n- some interesting remains of previous buildings\r\n- father and kids walked in circles, saw them in parking lot and then going back in the trail\r\n- looked that they were walking in the circles\r\n- a lot of side trails, good place for land navigation\r\n- went back to parking lot, but wanted to set up the hamock in the sun\r\n- walked back for 10 minutes back where we walked and set up it up off the trail\r\n- hamock was too comfortable so strayed there until got too cold\r\n\r\nSandy cried again said that I don't talk to her too much","tags":""},{"id":116,"title":"Snow hiking at Caskills","date_start":"2024-02-16","date_end":"2024-02-18","day_of_week_start":"Friday","day_of_week_end":"Sunday","text":"Friday\r\n- Head out on Friday for Catskills to hike to in the snow\r\n- stayed in the hotel, which was a nice move since didn't have to worry about late check in time\r\n- heading on friday and getting back on Sunday is perfect because too tired to it one day\r\n\r\nBuying condoms together\r\n- self check out was closed and Sandy had to go to casher with me\r\n- she was a little shy about it\r\n\r\n\r\n\r\nHike (Saturday)\r\nGoing up\r\n- snow in the morning, but it stopped and roads were clear from snow\r\n- some snowing in the hike\r\n- some people came without micro spikes overtook us but turned away bc too steep and icy \r\n- other group going down, one of them slid down, so decided to slid down as well on the way back\r\n- Sandy's microspikes were smaller so she had more trouble with grip\r\n- Last parts was getting even steeper, and Sandy had some troubles going up\r\n- She got some bruises from going up\r\n- At the end she was almost going to cry from going up\r\n- Some left over of protein shake made Sandy want to poop\r\n\r\nGoing back\r\n- Wanted to go to shelter, but decided to go to just to fire tower since it was getting too late in the date. Didn't want to hike in the dark\r\n- Very windy at the fire tower since it is open area\r\n- Wanted to go to up the tower, but it was too windy/go to go all the way to top, still had a good view\r\n- Saw clouds/snow coming in so decided to head back\r\n- Hot thermos was nice, but insulated bottle doesn't work too good, so next time bring stove so have boiling watter\r\n- Used poncho as cover from wind, blanket helped as well to be warm, but decided to go away from the wind\r\n- pee in snow, I had clear advantage compared to Sandy, she had to squat down in snow shoes\r\n- Sliding down a mountain on sleeping pad, trash bag\r\n- Warming fingers inside my mouth\r\n- Tumbling over after slid on trash bag, good thing camera was in the bag\r\n- Got back in sunset and 15 minutes later the sun was gone, good timing going down\r\n- Put Sandy's micro spike wrong way\r\n\r\n\r\nGoing back (Sunday)\r\n- McDonalds closed, but found one right on the way\r\n- Easy hike to the damn, wanted to go to waterfall in the beginning, but changed mind","tags":""},{"id":115,"title":"Cosco pizza and Black run","date_start":"2024-02-10","date_end":"2024-02-11","day_of_week_start":"Saturday","day_of_week_end":"Sunday","text":"Overslept driving dimka to air port\r\nluckuly live not far away\r\nwoke up for phone ringing, but it worked out\r\n\r\ncosco pizza\r\n- Figured out our shopping schedule, grab only essential food now\r\n- got ribs and going to cook them in slow cooker. Slow cooker was really nice for the chicken\r\n- spin a wheel to get cosco pizza or morestown pizza place\r\n- got whole pizza since it was cheaper compared to individual slices\r\n- pizza lasted for a bit\r\n\r\nBlack run preserve on Sunday\r\n- almost  no parking but were able to park\r\n- regular route that usually take before dinner\r\n- lower water level","tags":""},{"id":114,"title":"Started drawing classes","date_start":"2024-02-06","date_end":"2024-02-06","day_of_week_start":"Tuesdasy","day_of_week_end":"","text":"Sandy if feeling that is wasting her life and doing anything important. Asking what she wants  to do change it and what skill what she wants to learn. She wants to learn to draw  but never took a chance in that, but she had all art supplies to it. Looked at udemy what courses are available. There are some drawing classes available and bought class for drawing flowers. Did some lessons and it is very useful and has a lot of good information compared to practicing myself.","tags":""},{"id":113,"title":"Furniture shopping","date_start":"2024-02-03","date_end":"2024-02-04","day_of_week_start":"Saturday","day_of_week_end":"Sunday","text":"Sunday\r\n- shopping all day long pretty much\r\n- ikea a lot of browsing, but going to order all things online to make things easier and so don't have to wait to pick up things\r\n- Blood sex a bit, her period just started. A small blood stain of the sheets\r\n\r\nSunday\r\n- Rolebeling walk. The museum was closed, but the trail had a lot of signs that we could read about the history of the factory.  Some of the building were still there. Saw an older train. Trees started to grow all around it. The train was one of the attraction what I wanted to see since I saw it on the maps\r\n-Tried to id bird, the book was helpful with drawing","tags":""},{"id":112,"title":"Finally moved/clean everuthing","date_start":"2024-01-27","date_end":"2024-01-28","day_of_week_start":"Saturday","day_of_week_end":"Sunday","text":"Finally, helping Sandy to move all the stuff. Saturday cleaned up the apartment, donated stuff, and gave keys back. Kinda tired of moving stuff, but it is almost done. Were done with everything by almost the time end of the day to turn keys in. I did the last trash run and Sandy went to turn in the keys. \r\n\r\nSunday it was raining all day long so we all did is to go shopping. Got more household supplies and shopping. Decided to split the grocery bills and reflect it in the rent. Creating spreadsheet to see our expenses.","tags":""},{"id":111,"title":"Part of pipeline team now","date_start":"2024-01-22","date_end":"2024-01-22","day_of_week_start":"Monday","day_of_week_end":"Monday","text":"Got a meeting to become part of pipeline team from product team. Of course  I have accepted the change since I been working with pipeline team before and know what to do. \r\n\r\nGood change of pace since front end development is beings scraped. Might not be tempted to jump to different company if the work becomes interesting. Still might try to switch companies do get pay raise since 3% pay raise increase won't match how much I would earn if I move companies","tags":"work"},{"id":110,"title":"Finally moved all the furniture","date_start":"2024-01-19","date_end":"2024-01-21","day_of_week_start":"Friday","day_of_week_end":"Sunday","text":"- Snowed of Friday and been moving the last bits of peaces. Still going to more some of the stuff later on next weekend. Tried to drift a bit in my new car, it is harder to do compared to older car. Tried to turn off traction cotrol, but there was not enough snow. The empty snowy parking lots tempted me. Drove around Sandy's house to get a place to get tires loose, but there weren't any.\r\n\r\n- Movers pick up furniture\r\n- Snowed couple days before, was worried that would be too much snow for moving especially driveway could be icy\r\n- sofa could fit into elevator after all\r\n- movers went to the wrong address, google maps sometimes has the wrong address since our development is too new\r\n- sofa could actually fit upstairs, just had to do little bit of push, but walls got damaged a bit\r\n- Sandy was confused why it cost so much, misunderstood the price structure. Thought that two hour minimum would be $200 and not that two hour minimum are $200 each.\r\n\r\n-Setting up home office rest of the weekend.\r\n- Went to Raconcas park on Wednesday so we could see snow. Pretty god views walking in the snowy forests. Decided when to hike in Catskills and see snow there. Probably will go to Hunter Mountain fire tower. Tried to find abandoned house, found the location, but it been demolished. \r\n- Needed to go to Home Depot again since needed to drill some pilot home for Sandy's desk. THis store becomes very popular since we moved.","tags":""},{"id":109,"title":"More moving stuff, think almost done","date_start":"2024-01-15","date_end":"2024-01-15","day_of_week_start":"Saturday","day_of_week_end":"Monday","text":"Helping Sandy move again this weekend. At the end of the day both of us feel exhausted. Got the last two wire racks from target since it would be quicker that home depot. Having Monday off due to holidays so managed to move most of my stuff and do some room cleaning. What is left over are the bear necessities. \r\n\r\nTried to get internet cabling figure out in the new place. Found there the ethernet cable goest. It goes to secong floor as a phone line, but there is a way to update it for internet usage. Got crimpers and some jacks in case want to do it later. Looked at set up guide and provided gateway uses coax for the internet. Wasn't aware that are able to provide high speed internet through coax now. At least I have crimpers and jacks in case I want to build my own home network.","tags":""},{"id":108,"title":"UI development might be cut sadly","date_start":"2024-01-10","date_end":"2024-01-10","day_of_week_start":"Wednesday","day_of_week_end":"","text":"Front end is being de prioritized for out development. So will have to do more of back end work and writing tests now. Will try to work with pipeline team so can learn move about DevOps/k8s. Other than that, might become stagnant with dev skills, since all we use is Spring Boot, and I am not that involved in that process. Have more desire to move to new company so can improve my skills and get more salary. Need to do more leetcode code and continue learning.","tags":"job"},{"id":107,"title":"Dimka gf and covid update","date_start":"2024-01-08","date_end":"2024-01-08","day_of_week_start":"Monday","day_of_week_end":"","text":"Dimka is dating now, Going to go there over valentines day and she is going to come over during spring times. Thinking about marrying soon, and is not sure where he is going to end up living. CA or NJ. His coworker got COVID at the conference, so all of us got covid and he was patient zero","tags":""},{"id":106,"title":"Moving all day long","date_start":"2024-01-06","date_end":"2024-01-07","day_of_week_start":"Saturday","day_of_week_end":"Sunday","text":"- moving to new place, since go the keys this week\r\n- Sandy has a lot of stuff\r\n- Snowed a bit, but it all melted later on\r\n- Walked in the park again \r\n- cart came really in handy, good investment\r\n- assembled outside while it snowed a bit\r\n- a bit heavier duty what we need. More meant for yard work\r\n- sandy back hurts, needed some massage\r\n- Doesn't like tiger balk, it is too cold\r\n- she enjoyed reusable hot pack, so felt asleep few minutes after I put it on","tags":""},{"id":105,"title":"Another holidays at LA","date_start":"2023-12-21","date_end":"2023-12-29","day_of_week_start":"Thursday","day_of_week_end":"Friday","text":"Friday\r\n- biking to beach\r\n- my bike had flat tire and handle was missing, so used other bicycle\r\n- not as many homeless people as before\r\n- Jewish party again\r\n- one guest is in canabis industry going state to state to set up things for people where it just became medically legal\r\n- interesting consulting work\r\n- Sandy and I were mostly listening\r\n\r\nSaturday\r\n- Cosco, got left out\r\n- Sandy got upset because of that, and cried in bed again, She is not good saying no to my mom\r\n\r\n\r\nGetty museums - Tuesday\r\n- were first to be in \r\n- perfect parking spot\r\n- taking pictures of building while no one is there\r\n- photography gallery was interesting, can relate to art\r\n- korean bbq in ktown, first place was one hour wait, found somethind down the road\r\n- still know my way around la a bit\r\n- family dinner, \r\n- Making fun of Arina with Dimka. Wants to we taken cared of no strong independent woman as in the US. \r\n\r\ngot sick - Wednesday\r\n- wanted to go to obesrvatory, but didn't feel well\r\n- got better after lunch, helped hang painting, kinda anoying\r\n- went to ramen afterward, since Sandy wanted to go\r\n- Hollywood sign drive in \r\n- mom wanted to go for fancy dinner, but canceled it since all of were sick\r\n- told that went to santa monica to hang out, but went to ramen isntead\r\n- eating too much might been a mistake, feeling too bloated at the point it hurts and woke up during the night and tried to poop and wanted to throw up.\r\n\r\nThursday\r\n- Wanted go to getty villa, but got sick\r\n- slept most the the day, and don't have no appetite at all\r\n- Sandy period schedule might not be consistent because she got sick\r\n\r\nFriday\r\n- going home\r\n\r\nSaturday-Sunday\r\n- Sandy is sicker now, but I am the one who is normal now\r\n- Some packing to prepare for moving\r\nMonday\r\n- wasn't sure if it was day of or not\r\n-drove home, all people were offline, decided not to work\r\n-came back to Sandy","tags":""},{"id":104,"title":"Got out place","date_start":"2023-12-19","date_end":"2023-12-19","day_of_week_start":"Tuesday","day_of_week_end":"Tuesday","text":"The agent was on the vacation and reached back to us. We signed a contracts and have a place to stay now. Need to adjust my 401k contribution since the deposit was pretty high.","tags":""},{"id":103,"title":"Class is done","date_start":"2023-12-14","date_end":"2023-12-14","day_of_week_start":"Thursday","day_of_week_end":"Thursday","text":"Class is done. Group project was not fun since I did most of the work. Hopefully never again","tags":""},{"id":102,"title":"More house hunting","date_start":"2023-12-16","date_end":"2023-12-17","day_of_week_start":"Saturday","day_of_week_end":"Sunday","text":"- Pushy housing to lease\r\n- no parking, but the house is brand new\r\n- burlington is kinda run down\r\n- walking on burlignto river walk\r\n- kinda run down, older houses\r\n-  not that clean\r\n-  looking at area where we walked, interesting  history of industry here\r\n- try to walk heritage trail next time","tags":""},{"id":101,"title":"Still house hunting, might found a match","date_start":"2023-12-09","date_end":"2023-12-10","day_of_week_start":"Saturday","day_of_week_end":"Sunday","text":"- Still looking\r\n- Were outbid on the the house that liked\r\n- had some time to kill before next housing. Went to a park, did a boundary state park it was on the way =. first option was raconcas park, but realized whre we were an switched park\r\n- Found a nice one for 2800 it is pretty big for us, but price is not too bad\r\n- nicely renovated\r\n- both liked the place and did application soon after we got back home\r\n- walked around the complex and it is pretty nice area to walk, and small park is right across the street\r\n- wegmans is right next to it and got some pastries, bot of us were hungry and sandy took extra bite and we laughed about it","tags":""},{"id":100,"title":"Still loking for houseing and discovering parks","date_start":"2023-12-02","date_end":"2023-12-03","day_of_week_start":"Saturday","day_of_week_end":"Sunday","text":"- found place that looking was gone looking at zillow maps\r\n- found another place, slightly bigger, more convenient for both of us\r\n- walked around neighborhood, some highway noise at some parts\r\n- nice pond and 'trail'\r\n- breakfast omlete is becoming a tradition\r\n- walk in newtown park\r\n- guck yelling at each other, but not fighting,\r\n- trying some fruits\r\n- going inside corn field","tags":""},{"id":99,"title":"Trust is less, friends giving","date_start":"2023-11-22","date_end":"2023-11-25","day_of_week_start":"Wednesday","day_of_week_end":"Sunday","text":"- Sandy got sick\r\n- she felt that I dissmissed her\r\n- cried a lot\r\n- didn't feel like I am being supportive\r\n- probably need to call her and figure out what is going on\r\n\r\nFriends giving\r\nMoving furniture\r\nJewish in Brodaga story with Diana and Brodyagi. Diana olivious\r\n\r\nSimilar hike\r\npeople look different when not in hiking clothes\r\na lot of laughung and inapropriate jokes\r\nkinda tired from talking\r\n\r\nLooking at house, second house is nice and almost perfect for us\r\nDiscussing how sandy feels\r\nasked if wants me to stay over, was hesitant, but it payed off\r\nwere able to talk it out","tags":""},{"id":98,"title":"Am I fired, lost access","date_start":"2023-11-20","date_end":"2023-11-22","day_of_week_start":"Wednesday","day_of_week_end":"","text":"- can't get inside building \r\n- still have access to everything else\r\n- some form was not submited correctly","tags":""},{"id":97,"title":"Hiking same place different time","date_start":"2023-11-18","date_end":"2023-11-19","day_of_week_start":"Saturday","day_of_week_end":"Sunday","text":"- working out together\r\n- Sandy got really sore the next day\r\n- Looking for place again, visited one\r\n- Bagels by the lake, needed blanket and foam mat to sit on metal branch\r\n- Hiking franklin parker preserse\r\n- Dimka hiked it before we got there\r\n- red trail again\r\n- water is low\r\n- found cranberries","tags":""},{"id":96,"title":"New Hope daytrip","date_start":"2023-11-10","date_end":"2023-11-12","day_of_week_start":"Friday","day_of_week_end":"Sunday","text":"New Hope\r\n- woundering why a lot of irish pubs\r\n- old railroad\r\n- old train\r\n- coffe\r\n- walk around\r\n- nice chanels\r\n - train history\r\n- chanel history\r\n- looking at houses there\r\n\r\n- talking about housing \r\n- might be too much 3800/month with all fees\r\n- thinknmng that renting and saming for deposit might be better opttion\r\n-  not sure whne moving in together\r\n- Sandy became started crying right before leaving fore her trip. She is insecure about her future\r\nHike Sunday\r\n-Dimka drives too fast\r\n-Ilgiz is depresse\r\n-shoe broke, draw penis\r\n-can be chilly just sitting down\r\n-need to bring gloves\r\n-texmex, no fauvorite reustatrant, portions are smaller and not as tasty\r\n-making fun on Diana. ED stands for erectolile disfunction","tags":""},{"id":95,"title":"Looking at houses and deserted willage","date_start":"2023-11-04","date_end":"2023-11-05","day_of_week_start":"Saturday","day_of_week_end":"Sunday","text":"Sandy has period so we are not going for the hike today. Decided to hike in deserted village for a small hike. It was some nice older houses and has a lot of signs to explain what was there. It was small industrial area and then a resort. Stopped at a damn and took some nice pictures. Decided to go back since it is starting to get darker. Some other couple came for wedding pictures if they came over 20 minutes they would be in the peak light. Going back was a right choice since it got dark pretty quickly. \r\n\r\nMore cooking together, no more going out eating. Drove to houses area together in PA and have lunch around that area. We enjoyed area, a lot of open space to walk around. Looked at the area again most of houses are oil heated and no natural gas heating, definitely a deal breaker. Looked where gas lines go and deciding where to buy a house. Also Sandy wants to have gas stove, so have more housing requirement.","tags":""},{"id":94,"title":"Garden lunch and cooking together","date_start":"2023-10-21","date_end":"2023-10-29","day_of_week_start":"Saturday","day_of_week_end":"Sunday","text":"Walking on garden date this weekend. sandy organized this trip. It was a nice place and a lot of pretty flowers and trees. It is a perfect place for a date. Sandy made some food that we took with us. After a bit got hungry and had a picnick here. Used insulated bottle to get some tea as well. Similar idea how the date was when I brought a cheese cake. We were a bit tired after lunch so we took a small nap. sandy had a ground sheet that we could lay down.\r\n\r\nContinue cooking together, and had a small work out again\r\nWatched Black Clanstman. It was  pretty interesting nice. Sandy doesn't get some references, since she didn't know the US backround history. \r\n\r\nWent to the orchard again, but in in rain this time. Luckily I had  a rain jacket in the car. Got 3 bags of apples this time. 2 for me and dimke and 1 for sandy. Got different kind this time. We were lucky and we had to pay only for 2 of them. The worker didn't really weight the last one.\r\nContinue looking at houses","tags":""},{"id":93,"title":"Feeling not productive again","date_start":"2023-10-27","date_end":"2023-10-27","day_of_week_start":"Friday","day_of_week_end":"","text":"Not feeling at work again. Kinda in a rut since doing a same thing which is testing. Don't want to position myself as being a tester person for the project. Hopefully more different work is going to be next sprint. UI work is coming in few month as well.","tags":"job"},{"id":92,"title":"Shenandoah Trip","date_start":"2023-10-20","date_end":"2023-10-23","day_of_week_start":"Friday","day_of_week_end":"Monday","text":"Going to Shenandoah this weekend. Decided to go there since Sandy heard about this park, but never been there. It was pretty close drive, some of the drive was familiar when I went to West Virginia. As we got to the park, we stopped at the first available overlook. There we a lot of overlooks to choose from, and after a while we got used to all the overlooks. The other people had similar reaction to overlooks as us. It got pretty foggy shortly after we drove, and we drove in the fog for a little bit. The overlooks that we saw in the beginning were the only overlooks that we saw that day.\r\n\r\nStopped at the caverns before we got to our yurt. It was a nice experience since I haven't been in those caverns before. Coworker had recommended visiting these caverns as well. Apparently they are biggest caverns in t he US. There was a organ that hits rocks and makes as sounds. Previously this cavers been used as weddings reception as well and balls room. The yurt was pretty close to the caverns which was pretty nice. Drove through the town to see how it looks like. It is just main street and older PA town.\r\n\r\nYurt was pretty nice, and it was out first experience staying in yurt. Had plenty of open space to store out stuff and had a microwave and fridge. Definitely worth the convenience to hiking location and the town. \r\n\r\nThe day prior it was raining and some of the firewood was slightly damp. I failed to start a fire even though I used fire started. I could have started it, but it would taken me longed to do it, so we gave up and decided to continue next day. Decided to go for dinner in Italian place to eat. We went there for all days for dinner since we enjoyed and didn't want to change things up. During the night cuddled a lot since it been a little cold outside. First time that we felt asleep hugging each other. I tried to get away from sandy, but got to her right away since it was cold outside. At the end of the  night I was at the edge of the bed while Sandy is cuddling me.\r\n\r\nFirst day we hiked through  big meadows. I made joke that it looked like lake district UK. I didn't have map with me so I had to improvise what trails to take. Wanted to go through meadows for sure, so slightly modified our plan. Found place where park stores some it equipment. It was a nice detour. It was all the way down. The midpoint was a former president summer residency. We had tour of the house and we got lucky that park ranger was there to show us it. This attraction was a nice and accident addition to our hike. Improvised our way back since it would take us 7 miles to go back if planned to go the trail that planned originally.  The improvised hike worked and we did about 8 miles that day. When we came out from the woods, the cars were everywhere. Some cars parked on the grass. We got a premium parking spot since we got there in the morning. On the way back there was some traffic to get to the park exit. We saw a lot of people parked everywhere. The wood dried out more or less, so had a small fire going. Had to do some extra preparation to get fire going. Used fire to dry out some of the remaining of the wood. \r\n\r\nSecond day was a harder hike, did a loop again. It was going all the way down and then straight up for 3-4 miles. Decided to go other direction that all trails said. All trails wanted to go speed down and more gradual going uphill. It was correct decision when we started going uphill. On the way down there were a lot of nice waterfall and we were walking by the creek. Got some few nice views but it was mostly in the forest. Stopped for lunch at one of waterfalls. Were getting tired a bit as we got closer to midpoint. Not stopping for views as much anymore. Sandy had to peed, but she was concerned about snakes. She was jealous that I could pee anywhere I wanted. She started to look for spots shortly after I went. However , the canyon got narrower and hillside steeper with less opportunities to find a spot. Shortly after she peed we found a sight that to be wary of snakes in the area.\r\n\r\nGoing uphill was pretty difficult, and we had to do plenty of small breaks. First one was by the waterfall. The mat and green blanket came in handy to we don't get too cold when sitting on cold rock. Sat there a bit and continued on. One of my concerns that time was that it might get dark soon. At some points the sun was behind the mountain on out left. I had headlamp and flashlight just in case for such scenarios. Talked to some of the ranger he approved that we chose the way we did out loop. It would been a lot of scrambling if we went the direction all trails suggested. Sandy is not completely healed up yet as well. \r\n\r\ntrafic jap, road bloack\r\nsome trees don't have leaves\r\nthink too much about programming, thinking about registration message when inserting\r\nplate from pizza box, and \r\nsandy started to wear my jacket\r\nziplock bags came in handy already, storing it in car. Put my lunch there\r\nSandy screening job aplicants while in bed","tags":""},{"id":91,"title":"Inprovized date","date_start":"2023-10-15","date_end":"2023-10-15","day_of_week_start":"Sunday","day_of_week_end":"","text":"Talking about more about moving out. We will see what is going to do. At lest we are having this talk and thinking about our future. Decided to go to park in PA to check out the area and do something. The weather is not best this weekend for hiking. On the way there saw that there is cars coming from the farm. Park was nice, similar to Sandy's but less people there.  On the way back stopped at the farm. It was a pretty nice orchard. Sandy is not good at committing crimes. We ate some apples from the trees even if we weren't supposed to do it. She doesn't know how hide that she is eating apples. Went to italian place to for dinner. She wants to wash hands after the we come back home. Overall being not serious and joking a lot.","tags":""},{"id":90,"title":"PA backpacking turned camping","date_start":"2023-10-09","date_end":"2023-10-09","day_of_week_start":"Friday","day_of_week_end":"Sunday","text":"First da\r\nAnvar organized backpacking that turned into camping trip instead. We are going to day hike things that we were planning to backpack. Arrived there Friday evening. Going to PA now.  Realized that socks that I kept in me hiking backpack got wet. The bottle lid was leaking. I dried them off by using heater seats and seating on them and by using window defrost.  It was too dark too see mountains when I got of the highway. Followed car after a highway for about 20 minutes on a dark road. Met with Anvars friend. They went to same college together. The reason why it became a camping trip was because of him. He didn't think he would be able to do backpacking physically. It was drizzling and we used umbrella to hide under it. Anvar's friend had it. When Anvar arrived the umbrella was to small for 3 of us. Used tent shell and umbrella to cover ourselves from rain. We felt like we are homeless people. Drank some bear and had dinner, chat and go to sleep. The green David's rain jacket was pretty nice especially since it covered up legs. Sadly I forgot to bring my lightweight poncho. Maybe for the future would need to bring/buy tarp for this reason. Forgot a reflective blanket tarp as well. I set up tent in light rain, but it wasn't too bad. Thought that someone was trying to open cars doors thought the night. It was Anvars friend. It was nice that that it was raining since I couldn't hear Anvars snoring too much. Quillt worked pretty nice, just needed to adjust straps correctly. \r\n\r\n10 mile hike\r\nIt was still raining when we got to the trail. Decided to wait it out a little bit for wearer to get better. Anvar missed a trail and we had to do little bit of bush wacking. I thought that I saw the trail before but I thought that Anvar knew better where to  go. He is not great with navigation. Most of the talked to Kosta. Talking about the cost of housing of ownership. Had only one overlook for the entire day, the majority of the trail was inside forest. Found some pipelines on the trail. It was an interesting location for the lunch. The trail was pretty steep at the times. At one point is was really steep to go down. Glad that we didn't do backpacking and choose camping instead. At the end of the trail had some minor blister happening, but we were almost at the end of the trail.  Got some tape, but the blisters were really minor. Drove at the back of minivan to pick up our cars from the start of the trail. We made jokes that we are bunch of immigrants. \r\n\r\nDinner\r\nSinging sapogi mertveca, all got quet. Should have a playlist that I prepared to play when people ask to sing them something. Was trying to start fire. Some of the wood was little bit damp, so had trouble starting fire. Kostya brought some dry firewood with him and it helped fire going on. The fire started was pretty nice to use as well. Going to buy more of it after I run out. \r\n\r\n15 miles hike\r\nSecond day of hike was mostly on the forest as well with not many overlooks. Decided to go around, and take longer path so we don't need to go up and down mountain. It was worth detour since the hills are steep here. The trail would be where the erosion would be. One of the guy with us was an alpinist from soviet. He talked about his experience with that, and it was interesting to hear how people did it during soviet union. People made their own gear, down jackets, and he ordered titanium spikes from factory he worked at. Encountered more gas lines on the trail. It looks like there is a lot of fraking in these mountains. Decided to make another trail change and we walked on pipeline road for a bit. It was a good chanvge of pace because we could walk side by side and talk and it would not as steep or rocky as regular trail. Saw several dead snakes on the trail. Came down to another rail trail. At this point my feet were hurting a little bit since walking on hard surfaces is not comfortable in my shoes. At mile 8 got to a minivan that was left as just in case. The rest of the carts were in the beginning or at the end of the trail. Had some lunch on blanket there. A lot of people were not concerned leaving food in their car as I did, so got some extra food in me. Some people decided to go home from this point and some of us continued on. Anvar missed a trail again, and almost started bushwhacking again. Looked at my map and saw where we had to go. It was a little bit confusing since we had to go through road that looked like a driveway. Struggling with the last uphill a bit. At the end of trail saw only couple of overlooks for the entire trail again. Anvar lost trail again when coming down. He missed a turn when hiking in front of us and didn't see where we could cross the river.\r\n\r\nGoing home\r\nMissed a turn to go on interstate. Stopped to get some Panera bread on the way back","tags":"hiking"},{"id":89,"title":"First test","date_start":"2023-10-03","date_end":"2023-10-03","day_of_week_start":"Tuesday","day_of_week_end":"","text":"First test of the class. Didn't study. Feel that class is just check mark and learning about C++","tags":""},{"id":88,"title":"Jim Thorpe day","date_start":"2023-09-30","date_end":"2023-10-01","day_of_week_start":"Saturday","day_of_week_end":"Sunday","text":"Decided to go to Jim Thorpe this weekend. Were thinking joining Dimka on his hike, but Sandy's ankle still not healed fully. Went to overlook. There were a lot of cut trees on the trail, and we walked more on forest road more that actual trail. sandy was walking slower than usual, she found out that she got period on the trail. Had to  bush walk a little bit to get to first waterfall. Overlook was nice. We decided to stay there for a bit. The sun was on us, so I used my blanked to give us some shade. It was first time I used that blanket in that way. Eventually will buy a hammock that both of us can relax in. \r\n\r\nThe town was nice to walk at. There were not as many people as usual. Pictures come out better. Met Dima Rasoxin there. That was a pure coincidence. He suggested us place to eat, and went to eat there.","tags":""},{"id":86,"title":"Backpacking Catskills with sandy","date_start":"2023-09-22","date_end":"2023-09-24","day_of_week_start":"Friday","day_of_week_end":"Saturday","text":"Start\r\nTrying out backpacking with Sandy this weekend. I choose a very easy route that she might enjoy, nothing too strenuous. Decided to stay the same place where Anvar and I stayed when we did Devil's Path. Chose this place because campground it is open about 8 pm and will take us some time to get there. Sandy was also coming from her work trip in the afternoon, so there is no chance to go to campsite early.\r\n\r\nGetting there was not too bad. Way less cars compared to when we went there over public holiday. Adaptive cruise controll worked great. It s a nice feature to have on long road trip. Taking my car for long trip for sure from now on. Got to the campground close to closing time, but it was all good. We were the only people at the campground, so we could choose any campsite. Drove a little bit to find out spot. Drove little bit \"off road\" to circle around. The original campsite was too rocky for tent to sleep. So drove around the campground to find a spot. Got out to see if place is correct. Conveniently had flashlight in my trunk so we can explore. Walked around and found flat and non rocky place at the bottom of the hill. All the soil is washed here from the hill. It is was very close place where we slept last year. Got firewood from last time and had a nice campfire going. A lot of noises of frogs, owls, coyotes, and trains in campsite.\r\n\r\nStart of the trip was not too bad. It was not raining yet as we were afraid of. In the beginning it was kinda chilly. When about to start hands were cold. Asked if Sandy needed gloves since she was trying to get her hands warm while we walked. After couple minus of hike turned around and got cloves from my car. Luckily I had to pairs of gloves in my car. Uphill was not too bad since it was pretty wide trail. Stopped at one of the shelter for the out lunch. It had overlook right next to where we stayed. As we started to have lunch more rain came in and the overlook was covered by the clouds. We were for nice overlook just in time since it would be our last overlook the entire trip. Decided no to go to ski resort area since it is raining and that area is exposed unlike forest. We made a correct decision since there would be no views to see. Everything would be covered in clouds. Came up to fire tower. Had a small tour of fire tower gatekeeper hut. When went to on top, barely see anything. Tour of fire tour hut was the highlight of the day so far. Rain jacket worked pretty well in small rain.\r\n\r\nGot pretty happy that modified the tent.There were too many rocks in the ground. Longer guylines definitely helped to find where can find where to put stakes it. Had to us one of the metal piece to get steak fixed in. The tent was perfect for two people. It was wide enough. There was a lot of wind during a wind and was little bit concerned that the wind would break down the tent. However, the tent stood up. Sandy was worried about it as more than I did.\r\n\r\nTried to watch movie while in tent. Put a tripod on a string so phone hangs from roof of the tent. I am leaving that close line inside the tent. Sandy felt asleep 20 minutes into the movie which was pretty funny. Heard some noises through the night. Probably some animals near by, but ursack worked. Quilt worked pretty well. Can't beat its weight. However there were some drafts coming it. It might been because I was in the way of the wind. Will try to adjust straps next time. Surprisingly there were a lot of people on the trail backpacking and some even decided to do the entire devil path event though it was raining and cold\r\n\r\n\r\nSecond Day\r\nWoke up in the low cloud mist. Everything was wet and covered in dew. Going down was super boring it was all rocks and down hill. Came to overlook, but it was all covered in clouds and because of that decided not to got to second Hunter mountain and second big uphill. Came to waterfall. It was pretty nice again, but not as many yellow leafs as last time. Went to the same place for food as last time and they messed up our check again.","tags":""},{"id":85,"title":"Renisance fare with new car","date_start":"2023-09-15","date_end":"2023-09-17","day_of_week_start":"Friday","day_of_week_end":"Saturday","text":"Got new car. It was a pretty easy process, just needed to do paperwork. Taking it easy with driving to break in the engine. \r\n\r\nWent to renisance faire  for the first time. Always knew wanted to go and I knew it was close by and it was a perfect occurrence. It was a lot of people with a lot of people dressing up. Watched some play. It was interesting by needed subtitles to understand what is going on. Walked abound a bit. Besides shows there were a lot of vendors. Watched glass blowing demo and music show. The last show that we watched was dirty poems one. It was pretty good stand up. sandy said that she is overwhelmed with dirty jokes. \r\n\r\nTried local gym at Sandy's complex. It been a while since I been in home gym environment. It is pretty nice and has most of the things. \r\n\r\nWe were sleeping a lot for some of the reason on Sunday. Discussing our future and what are the next steps in out relationship. Preparing for backpacking trip in Catskills. Got ursack from REI and Sandy got all gear already. Felt like I was in the army again when she needed to adjust her backpack. Pullinng on straps and not be roo gentle about it. She doesn't know how to feel to wear bigger backpack, so took some time to get everything to set up.","tags":""},{"id":84,"title":"Funeral","date_start":"2023-09-08","date_end":"2023-09-10","day_of_week_start":"Friday","day_of_week_end":"Sunday","text":"Watch same movie with Dimka, very similar interests\r\nSaw some of davids family, still remember some of them\r\nWearing same shirt as dimka, we are not twins\r\nmost tearing up when Craig came in and folding of the flag","tags":""},{"id":83,"title":"Catskills trip","date_start":"2023-09-02","date_end":"2023-09-04","day_of_week_start":"Saturday","day_of_week_end":"Monday","text":"Rented out cabin for Catskills. It was nice and not far away from trails. Tried to do astrophotography with camera again. With long exposure can see the rotation of earth if expose to 30 seconds. 10 seconds is enough not to see the rotation. The first day we went to damn for a small walk before we can check in. While we were walking there Sandy got her period, she was surprised it again. Had to stop by a store to get period supplies. \r\n\r\nWent to waterfall instead of long hike since Sandy's period. Decided to go early to beat the crowd. It was smart idea since when we were done there was a line to get into parking lot. Saw a lot of flowers there,. The waterfall looked the same as last time. Good thing that I been in Catskills before several times. I know the general thins where trails are located, so I was able to adjust where to go. \r\n\r\nAfter the hike took a really long nap middle of the day. Both of us enjoyed it. Were thinking where to see sunset, but there is no overlooks to drive on. Decided to go back to damn again since it is open area where we can see the sunset. Enjoyed some black and white photography.\r\n\r\nGot some handy since Sandy was on her period. Deciding to where to backpack in Catskills in few weeks.Have general idea where to go.\r\n\r\nOn the way back went to small railroad museum. It was former train station and it was interesting local history. Went to get food before we head out. We got our order and were waiting for the bill. However we had to pay after food ourselves.","tags":""},{"id":82,"title":"Sandy crying","date_start":"2023-09-06","date_end":"2023-09-06","day_of_week_start":"Wednesday","day_of_week_end":"","text":"Started crying when sleep\r\nFelt that she is alone even in relationship\r\nhas high expectations of relationship \r\ndidn't like jokes or topics about money sharing","tags":""},{"id":81,"title":"First day of classes","date_start":"2023-09-05","date_end":"2023-09-05","day_of_week_start":"Tuesday","day_of_week_end":"","text":"First day of school. The professor has very thick Spanish accent, and some people left shortly after he started talking. Going to learn some C++ this semester. Should be an easy class at least for me. First assignment is a busy work printing out some values","tags":""},{"id":80,"title":"Willow was let go","date_start":"2023-09-01","date_end":"2023-09-01","day_of_week_start":"Friday","day_of_week_end":"","text":"Will let go today due to low performance. She messaged about it and we had a small call about it. She got call from her that she had call with manager and hr. I quickly checked my calendar if I had similar invitation as well. Luckily I didn't but I don't have such invitation, and feeling that my end might be soon. The contract runs till October only and then I am unsure about my fate again.","tags":"work"},{"id":79,"title":"Conviniet hike day vise","date_start":"2023-08-26","date_end":"2023-08-27","day_of_week_start":"Saturday","day_of_week_end":"Sunday","text":"sandy leaves saturday, hike sunday\r\nwatch movies, they took nap for couple hours\r\nwanted to try it raw again even said doesn't want it like that previosly\r\ntaled a lot of people at hike\r\nIlgiz decided to drink coolade and stay with the company\r\nlong break\r\nsay lakes\r\nditched other people","tags":""},{"id":78,"title":"Contract is updated/extended","date_start":"2023-08-21","date_end":"2023-08-21","day_of_week_start":"Monday","day_of_week_end":"","text":"Talked with Willow today. Out contract is been updated and we are not going to be unemployed for a little bit more. However, out contract is only extended for another 2 months. Let see how it goes. Willow speculates that some one in LM doesn't like our company since other people seem to be happy with our work","tags":"work"},{"id":77,"title":"Different hike similar place","date_start":"2023-08-19","date_end":"2023-08-20","day_of_week_start":"Saturday","day_of_week_end":"Sunday","text":"Legigh valley, but differnt direction\r\nMore quartzite identification. Know how it looks for sure.\r\nNice place for sure\r\nMexican place again\r\nSandy twisted ankle, doesn't like taking tylenor or drugs in general I think\r\nLikes to be independent \r\nwoke up middle of the night medium pain, didn't like to take medication\r\nmade improvised ice pack for her\r\nenjoy sunset together","tags":""},{"id":76,"title":"Unfortinute job update","date_start":"2023-08-17","date_end":"2023-08-17","day_of_week_start":"Thursday","day_of_week_end":"Thursday","text":"Had a call from manager, purchase order was not finalized yet even thought I was told that everything is negotiated. Not sure where going to be next week now. Willow is in the same situation. Both of out nit happy about it.","tags":"work"},{"id":75,"title":"Enjoying rocks together","date_start":"2023-08-12","date_end":"2023-08-13","day_of_week_start":"Saturday","day_of_week_end":"Sunday","text":"Discovering more rocks with Sandy together at the hike. I could go with with Anvar to Stairway to Heaven hike or do my own hike with Sandy. I decided to go to place that looks like England with pastures. I brought binoculars with me because there was a marsh area, but I barely used them. Not too many birds there. Wild flowers are still blooming there. On first uphill saw a lot of interesting rocks. Sandy seem to be sharing that interest with me. I really love that I have a chance to share such interest with me. Find some quarzite like in other Appalachian trail. On the way back listened some geology podcasts as well. On the way back stopped at Unionvile, good thing I stopped there before and I knew places where to get food.\r\n\r\nThe sex is different now. She doesn't mind going doing it raw. Both of use seem to enjoy it more, but should be more carefully when she is ovulating.","tags":"nsfw"},{"id":74,"title":"Kayaking and not pregnant","date_start":"2023-08-05","date_end":"2023-08-06","day_of_week_start":"Saturday","day_of_week_end":"Sunday","text":"Decided to go kayaking since saw a lot of people on on the river all the time and wanted to try. There were a lot of people at the river. We decided to stop at one of the islands far away from people. It was pretty peaceful. And nice break to get away from the crowd. Most of the trip we were not paddling at all. The current was strong enough not to paddle. We got side by side on each other for a lot of time. On the trip found some nice cliffs that were eroded and a pocket of water where there is a lot of wildlife. I found a feather, but I lost it at the end. There were some 'white water' as we approached the end. It was excited even though it was not really challenging. However, Sandy go swept by the current and was turned around. At the river talked about marriage and our plans for the future.\r\n\r\nPeriod\r\nsome drawing\r\nkissing and then she turned away\r\ntalking about marige and future together","tags":""},{"id":73,"title":"Sandy is back","date_start":"2023-07-29","date_end":"2023-07-30","day_of_week_start":"Saturday","day_of_week_end":"Sunday","text":"Sandy is back. Pulling out on her and got her face. Both of us laughed about it. Had a small walk in the regular park. Found a nice spot slightly off the main trail that had a wooden dock on the beach. Send some time looking at rocks at beach. All of them were quartz. Found some nice shells as well that I brought home with me.","tags":""},{"id":72,"title":"Not being productive at all","date_start":"2023-07-28","date_end":"2023-07-28","day_of_week_start":"Friday","day_of_week_end":"","text":"Feeling not as productive at this project. Too much new technology. Hopefully going to change project when extension expires, just ride through it","tags":"work"},{"id":71,"title":"Saying goddbye, glad came","date_start":"2023-07-20","date_end":"2023-07-24","day_of_week_start":"Wednesday","day_of_week_end":"Monday","text":"Visiting LA, but it is the worst trip because if the reason to come in","tags":""},{"id":70,"title":"West Virginia Trip","date_start":"2023-07-15","date_end":"2023-07-19","day_of_week_start":"Saturday","day_of_week_end":"Wednesday","text":"West Virginia trip by myself, decided to take vacation since i have some time accumulated. Worked nicely especially since Sandy went to China. I found about the place just looking at map and looking what pictures posted. Found some interesting rocks/cliffs and wanted to see where it is. The drive was only about 5-6 hours and was not too bad. My car made it there pretty nicely. \r\n\r\nThe first stop that I stooped was at Scenica rocks. It was a reason why I went to this area. On the way there there were a lot of signs that explained geology of the area and general geology information. Took some pictures of that for my further information. Going downhill decided to go different way where mostly climbers go. Glad that I had trekking poles with me since the going downhill was pretty steep. Without them don't think I would be able to go there. \r\n\r\nThe cabin was plenty for me. I like this type of camping since I don't need to worry about hiding from bears. It was mostly RV part with some cabins on the side. Next time will need to find a campsite that have tent sides and cabin on the side. While I was walking around looking for a signal, I dropped my keys somewhere. I did a lap around and didn't see them. Luckily, I knew how to open doors with a credit card from watching videos and listening podcasts about physical security. Was not worried about keys after got inside, but walked a second lap and found keys in the dirt. The campsite was on opposite side of mountain where all hikes were. Should have choose different campsite, so didn't have to drive as much. But it was fun driving over mountain passes every day. Got more comfortable over time and tried to keep up with cars in front of me who are more local to it.\r\n\r\nTried to do astrophotography with camera, but it didn't work because of earth rotation and it is harder to focus on the starts\r\n\r\nWas worried about the rain the next day, so was thinking if should go to a hike or take a train ride. It started to rain early in the evening. Took some nice pictures of the fog in the trees. Too bad couldn't stop somewhere to do in with my camera. It kinda reminded me of Humboldt since there is also a lot of fog in the tree. Luckily it was not raining next day, and I did a impromptu hike to the top of the mountain. Too bad there was not an overlook as I expected. wanted to see fog in the trees. At one point wanted to take a bushwhack short cut on the way back, but decided to just back track my steps. There were a lot of ferns and area was very wet compared to other side of the mountain. There were no rain on other side. Guess the mountains stop all the rain.\r\n\r\nThe original hike that I planned was all 3 miles all uphill. Took me a while to get there and was exhausted by the end of it. Had to stop and lay down for a bit before went on the way up. The views were pretty cool since could see the erosion cliffs and chimney rocks. Saw found some cool rocks as well. Met some people doing a a backpacking as well. Asked them about it and it is double to do the trail in few days. Was definitely by the end of the hike\r\n\r\nDecided to eat ac camp store for the dinners. It was more convenient that going into town. Probably will stay on this side of the mountain if I go there in the future. \r\n\r\nWas little bit late for rock climbing and was stuck behind the log truck, but I have made it on time. It was interesting experience. All scrambling helped with climbing. Used a lot of upper body. My grip gives up since it was sweating a lot needed to take breaks. Needed to bring liquid chalk with me. Was not too scary even thought far away from ground.\r\n\r\nLast day doing white river rafting. It was not too hard or too excited. Next time need need to choose more challenging route. One person felt over. Felt slightly weird about this situation since going to go to LA tomorrow, so fun is not as much and thinking about other things.","tags":""},{"id":69,"title":"Some very bad news","date_start":"2023-07-14","date_end":"2023-07-14","day_of_week_start":"Friday","day_of_week_end":"","text":"Call from mom to come to LA. David has couple weeks to live","tags":""},{"id":68,"title":"Hard to hike in the heat","date_start":"2023-07-08","date_end":"2023-07-08","day_of_week_start":"Saturday","day_of_week_end":"Saturday","text":"It is hot again for the hike, and going up made things easier. The first couple miles was all uphill, and was super hard because of heat and humidity. After several miles had to stop for a short rest. All of use were exhausted at that point. There was a castle on top of the mountain. The story about it is that couple got divorced and they didn't want to split the property and they decided to abound the castle instead.  \r\n\r\nFond a nice turkey feather and I put it inside my hat. It looks pretty nice and other people called me native american on the pictures. Found some nice ingenious rocks as well. I knew some of them at least this time.","tags":""},{"id":67,"title":"Call with Sandy","date_start":"2023-07-07","date_end":"2023-07-07","day_of_week_start":"Monday","day_of_week_end":"","text":"Calling Sandy today. She is still waiting for visa documents to be processed. Just a lot of small talk, and I did most of the talking. Her mom is happy that she is finally settling down/is dating. Sounds like my mom.","tags":""},{"id":66,"title":"Always is ready hike","date_start":"2023-07-04","date_end":"2023-07-04","day_of_week_start":"Tuesday","day_of_week_end":"","text":"It is still hot to hike comfortably. Drank about 4 liters of water and still felt dehydrated after. Water filter comes in handy again. Filled up with water on the top of the mountain so that didn't have to carry extra water uphill. It is a must item during summer hikes. Feels harder to hikes as well. After we finished one mountain the half of the group decided to go home. We were tired again even though wee hiked only miles at that point.\r\n\r\nMy always getting ready for the worst payed up. It was started to rain at one point and I was able to use a small poncho that I always carry with me. She second time it rained, I didn't bother putting it on because rain felt nice after going all the way uphill. On the top gathered some blue berries. They tasted differently compared to local forest.\r\n\r\nNastas grandfather struggled with rock scrambling and needed some help going down. He was difficulty with depth perception. After the first mountain, some one drove him back home. \r\n\r\nWas looking more at rocks around here. Because of prior rail road construction, some rocks were exposed. Found some sand stones and slate which are sedimentary rocks.\r\n\r\nMade a lot of dirty jokes at the hike and out regular after hike dining place.","tags":"hiking"},{"id":65,"title":"Local hot hike","date_start":"2023-07-02","date_end":"2023-07-02","day_of_week_start":"Sunday","day_of_week_end":"","text":"Decided to do local hike instead of group hike since it we thought that it is going to be raining over the weekend. We decided to go to red trail in Franklin Parker preserve. Luckily we didn't see any ticks. Saw some blue berries at the trail and we stopped several times to gather some berries to eat. Tastes the same as in Latvia. Saw some turtle hatched eggs on the trail as well. Found some rocks at the trail. They were all quartz even though some of them looked orange. Smashed some of them with hammer to see how they are looking inside. Even though we 6 miles we felt like we walked 10 miles since it was very hot.","tags":""},{"id":64,"title":"Final days with Sandy","date_start":"2023-06-22","date_end":"2023-06-24","day_of_week_start":"Thursday","day_of_week_end":"Saturday","text":"Sandy is leaving for a month this weekend so trying to enjoy the last days with each other. Mostly just chilling watching the movies and just chilling. Asking each other some additional questions as well. Still enjoying each other responses and getting each other better. \r\nSome grinding on top of me, really enjoyed it and going to condoms feels the difference now. Some unprotected sex in the heat of the moment. Both really enjoyed it, but we know that we are not supposed to do it. Asked question about birth control, and she is not interested. Cant do anything about it. Asked her how she feels about it, but she keeps quiet and says that she doesn't have anything to say. However, I know it is not the case. Sandy is pretty good match, but she doesn't express her feeling a lot and I need to guess what she is thinking.","tags":""},{"id":63,"title":"Starting new project","date_start":"2023-06-19","date_end":"2023-06-19","day_of_week_start":"Monday","day_of_week_end":"","text":"Still figuring out architecture\r\nnot much work to be done","tags":""},{"id":62,"title":"Busy weekend Dianas bday and hiking","date_start":"2023-06-17","date_end":"2023-06-18","day_of_week_start":"Satrurday","day_of_week_end":"Sunday","text":"Meeting with Diana for her bday. Like with other bdays we are having a small walk and then do dinner. We choose to go to rose garden first. It would be a perfect place for a date, and me and Sandy enjoyed if while other people came over. Not surprisingly Diana was late for even her birth day. Sveta walked pass us while we stated at her, but we found each other later. We joked that that the garden looks like a backyard, but on bigger scale. The pictures Sandy and I came out pretty well as well.\r\n\r\nAfter the park we wend to Dianas house. It was pretty huge considering that she is living there by herself. The boys sat on one side of the table and girls stayed on the other. Diana told a story how she tried to rescue a deer that was injured, but instead she end up drowning it in the creek. Sandy got a review from Sveta.\r\n\r\nThe second day we went of hike. Still found a lot of ticks even on the grounds. Saw a lot a backpackers and same trail angels that make pizza for backpackers. At the end of the hike Diana wanted to go other place to eat that we planned. She is not a fan of American food. We had to convince her that we are middle of nowhere and so out choices are really limited. The place that we went has some live music, so that was nice as well. Roma wanted to give Diana all singles. His roommate is a stripper and he needs to get rid of singles that she gives him. Diana rejected his offer.\r\n\r\nhike\r\ntrail agels same place\r\ndiana wanted to switch dinner place again\r\nRoma wanted to give diana singles for food\r\n\r\nit might be too much russian speaking ion one day\r\ntoo many events and not enough time to enjoy each other","tags":""},{"id":61,"title":"Final Demo time","date_start":"2023-06-12","date_end":"2023-06-16","day_of_week_start":"Monday","day_of_week_end":"Friday","text":"Final week of this project. Doing mostly demo prep and maybe adding the last touches. On out dry run the services didn't dynamically started as we planned. Our plan was just restart all the services for the last demo. The final demo went pretty well, and nothing crashed. After the demo there was not much to do. I did some of pretty simple documentation and started to get on speed with the next project. Other that that taking it easy this week and getting more accounts setting up.","tags":"work"},{"id":60,"title":"Delaware water gap hike","date_start":"2023-06-10","date_end":"2023-06-10","day_of_week_start":"Saturday","day_of_week_end":"","text":"Hiking same mountain again. Since the hike was early, had to get up super early. I been at this places so many times, so not too many new pictures to take. Can still see the some smoke at the distance. Saw some tics already and Dimka caught two of them today. Some of the flowers are blooming, and I am having more fun with my plant identification app. Sandy enjoyed it as well. Mistook one plant for another, but there were were closely related to each other, the same family. Looked at rook identification app to see what rocks were around us as well. Giving interesting perspective about the mountain perspective from it. \r\n\r\nHad some nice waterfall on the way back, that we discovered that last time we had been here. At the end of the hike we decided to go to our usual place, but Diana wanted to get something else. We were driving to the place, and there was a lot of traffic for some reason. She texted that she is skipping the dinner. We just parked on the street since it was faster to park and walk compared to drive to the place. As we were eating the traffic was getting better. We made fun of her that she was sitting in the traffic while we were enjoying the dinner.","tags":"hike"},{"id":59,"title":"Bringing more with with work end","date_start":"2023-06-08","date_end":"2023-06-08","day_of_week_start":"Thursday","day_of_week_end":"","text":"Had a call with my manager regards where I am going to go next after my project ends in next week. I am going to be using hours that Ted was out for my upcoming project. So far not sure what the project is going to be though. Something in the same office. So now have extra 2 month before my job fate is decided. Just need to wait what if I am going to be told anything next week. I guess that is the fate of the consultant. I am definitely paid more that I would if I was full time employee. Overall, still not regretting leaving previous job since I grew as a developer a lot in this project.","tags":"work"},{"id":58,"title":"Demo time","date_start":"2023-06-05","date_end":"2023-06-07","day_of_week_start":"Monday","day_of_week_end":"Wednesday","text":"Having two demos this week. Evans laptop crashed on the first demo. It went not too bad in my opinion, but we were told that out presentations was too low level. At the end the presentation is going to be only 15 minutes with all details how things work omitted. Some people are not happy about it since if we do it it doesn't sound that impressive or that we did a lot of work. \r\n\r\nHanged out with Sandy. We did just cuddling since she was on period. It felt nice laying on the lap. Maybe too nice. I wasn't selfish and switched our position so that she can enjoy it as well. After we watched the movie we realized that it is already 2200. So we decided that I stay over when I come over the next day I come over.","tags":"work, Sandy"},{"id":57,"title":"Sandy is visiting family","date_start":"2023-06-03","date_end":"2023-06-04","day_of_week_start":"Saturday","day_of_week_end":"Sunday","text":"Sandy is hiking with the hiking group and \r\n-family seem to like her\r\n-going to join us for other hikes as well.\r\n-first period, could see it coming\r\n-","tags":""},{"id":56,"title":"Mom is visiting","date_start":"2023-05-30","date_end":"2023-05-30","day_of_week_start":"Tuesday","day_of_week_end":"Tuesday","text":"Mom and Natasha is vising for several days. She is still nagging Dimka that where his gf is at. We told her that we will take her to the hike if she behaves nicely. She still wants to be in charge, but we don't let her so much. Have different midsets as well. She want to be taken care off/not as independent and air head.","tags":""},{"id":55,"title":"Trip to Maine","date_start":"2023-05-26","date_end":"2023-05-29","day_of_week_start":"Friday","day_of_week_end":"Monday","text":"Heading out to Arcadia National Park today\r\n-cabin\r\nastrophotography\r\n-hikes\r\n-parking full, shortcut\r\n-10 mile hike, can keep up, slightly dehydrated\r\n-skipped over Bar Harbor and enjoyed smaller town\r\n-water filter\r\n-woke up middle of the night\r\n-falling in more now. \r\n-lighthouse walk","tags":""},{"id":54,"title":"More dating hiking","date_start":"2023-05-20","date_end":"2023-05-21","day_of_week_start":"Saturday","day_of_week_end":"Sunday","text":"Raining Saturday, so we decided to hike on Sunday. Spent some day going to local park in small rain and preparing for out trip to Maine.\r\n\r\nAnother weekend and hike with Sandy. She is able to go the same pace as me now which is pretty cool. Improvised some of the routes, so it was really adventurous. Had to pull out compass just in case went correct direction. Some of the trail was unmarked on the map. Had to see local mining history, mines and furnace. The overlook that we stayed the lunch was not the overlook that I visited last time, but with google photos I found where it was located and we chilled there for a bit. \r\n\r\nSaw some snake near the trail. Sandy definitely was scared of them. She likes the nature, but she doesn't like the nature things. Saw several ticks as well. First one was on her sock when she took her shoe off, one was crawling on the blanket, last one was on her shirt when we were driving back. Definitely going to get some bug spray that can apply long temp for clothing.\r\n\r\nSandy is definitely is starting to enjoy sex more now. The bed sheets were wet. Also, I am having fun as well especially doggy style. Feels like almost nothing. Will see if slowly able to bring using birth control condoms are useful, but not 100% effective and slightly more haste.","tags":"sandy"},{"id":53,"title":"Finding color is hard","date_start":"2023-05-15","date_end":"2023-05-15","day_of_week_start":"Monday","day_of_week_end":"Monday","text":"Had couple hour call with Indira to determine what colors to use. Linear gradient is gone to solid color now, and spent at least 30 minutes picking fonts. All that work for nothing. Wish had UI designer to make a design first so that I can work from that design and do less meetings. Two weeks left for development and need to add more features, but  still need to design park. With had at least couple weeks more.","tags":"work"},{"id":52,"title":"Ruslan birhtday, busy with gf","date_start":"2023-05-13","date_end":"2023-05-14","day_of_week_start":"Saturday","day_of_week_end":"Sunday","text":"This is going to be a busy weekend. Going to meet with Ruslan and then come over to Sandy's house, so took two cars to get there. The bowling was not too bad. Still a lot of small talk and dirty jokes. Dinner was nice as well. However, it felt that we were little bit ignored. The restaurant was understaffed. We joked that we were kinda ignored because we spoke Russian. \r\n\r\nGetting to Sandy took a little longer that I thought, so I had to tell he  my updated arrival. It going to good so far. Sex is nice as well, she seem to enjoy it more. She almost came several times, but she couldn't. Hopefully next time she is able to, so both of us can enjoy it. She rode on me and seem to enjoy just grinding, almost got inside, but I had to stop it before it got too late. It felt nice though, condoms are necessary for now. \r\n\r\nHiking with her was nice as her. We had a nice pace going on, she was almost was able to keep up with me. Only had to stop several times uphill, but going downhill was pretty fast pace. I am really enjoying this this dating relationship. We can enjoy hiking together, see is enjoying it as well. Found a nice spot for lunch as well. Sitting by the lake was nice as well. Decided that next time is going to bring a blanket with me so we can cuddle on top of the mountain.","tags":"dating"},{"id":51,"title":"Starting running couple routine","date_start":"2023-05-10","date_end":"2023-05-10","day_of_week_start":"Wednesday","day_of_week_end":"","text":"Sandy decided to start running with me. Did a small 20 minute run in the park next to her. Hopefully, we can progress in that direction. Had to stop through the run because she is not fit. Next time is going to do interval training. \r\nThis time it didn't feel hurt for her in bedroom, and she finally starting to enjoy this. After two times we discussed out plans and for Maine. Made some quesadillas, she was really impressed how I flip them.\r\nSome of this relationship reminds me the previous. She is not experienced and we cuddle the same way, and same body type","tags":"dating"},{"id":50,"title":"more design changes","date_start":"2023-05-08","date_end":"2023-05-08","day_of_week_start":"Monday","day_of_week_end":"","text":"More design changes from Indira. Some of the work that done before might not be relevant. Time to redo some work, but might not be too bad","tags":"work"},{"id":49,"title":"Hike/perfect date","date_start":"2023-05-06","date_end":"2023-05-07","day_of_week_start":"Satrurday","day_of_week_end":"Sunday","text":"Perfect date with Sandy this weekend. We went to a small hike ~6 miles. She was able to keep up and we kept a good pace. I think I found a pretty good partner. She likes hiking and being outdoors as well. The views were perfects as well. Found one secluded overlook where we had lunch. Also, stopped by the lake to enjoy it as well. Trees looked kinda like in early fall, and getting on top of fire tower opened even better looks. After the hike enjoyed the our dinner at the tavern.\r\n\r\nSlept over,\r\nstill hurts, but it is getting better, worked on it for several hours on and off\r\nfinally finished\r\nboyfriend girlfriend now\r\n\r\nplanning trip to maine most of sunday\r\nand still trying, bring lube next time\r\n\r\nI still do most of the talking, but she is more comfortable around me not\r\nSome home lunch","tags":"dating"},{"id":48,"title":"Sandara Call","date_start":"2023-05-02","date_end":"2023-05-02","day_of_week_start":"Tuesday","day_of_week_end":"Tuesday","text":"Got call from Sandra today. She is still inviting and wants to come to east coast and maybe visit Maine. However, I told her that I am not sure that I will be available. She wasn't expecting that response. Haven't told her that I am going out with someone","tags":"sandra"},{"id":47,"title":"Dinner date","date_start":"2023-05-04","date_end":"2023-05-04","day_of_week_start":"Thursday","day_of_week_end":"","text":"Meting with Sandy again. It is raining all week long, so we decided to cook something together at her place and just chill. I cooked some of my chicken. She seem to enjoy it. Still on period so we did some heavy petting. It is going good so far. A lot of cuddling as well and both of us are enjoying it.\r\n\r\nShe is still indecisive, so i choose the movie to watch. Decided to watch to scary movie, she was kinda scared a bit, and I decided to be nice and not to scare here even more.","tags":"dating"},{"id":46,"title":"Netflix and chill date","date_start":"2023-04-30","date_end":"2023-04-30","day_of_week_start":"Sunday","day_of_week_end":"Sunday","text":"Meeting with Sandy today late morning. We were supposed to go to museum, but we ended up stating in and watching Netflix and making out. She made me dinner and lunch that I liked a lot. I guess that she is trying to impress me. It is working. It was a nice staycation. Her period started today, so only make out. At one point ended on bed and felt asleep in each other arms. It was nice for a change. Made some mandales as well for dinner. Talked about or goal and what we want in relationship. So far have similar life values. She said that that her life changing event was meeting me. I guess that we are enjoying eachor company. She is kinda shy, and have trouble with small talk. We talked about it a bit. I have to carry the conversations in this relationship. The definitely feels more comfortable sharing her mind to me.","tags":"dating"},{"id":45,"title":"Dimkas bday","date_start":"2023-04-29","date_end":"2023-04-29","day_of_week_start":"Saturday","day_of_week_end":"Saturday","text":"Celebrating Dimkas bday, same group of people as usually. Going to small hike again. Tanya doesn't like hike and it rained the day prior. She didn't have any hiking shoes and was complaining that her shoes got dirty and wet. Were joking on Ruslan that he is going to get it after he goes home. Overall, just talked. Was kinda tired after the food to contribute to conversation. At the end of the party he was looking that he is dead inside. Played some guitar as well. My signing definitely got better according to videos. \r\n\r\nWas supposed to sleep over at Sandy's place tonight after the party, but had to scratch it. She got sick and wanted to sleep and take a rest. Still going to see her tomorrow.","tags":""},{"id":44,"title":"Dating success, seal the deal","date_start":"2023-04-25","date_end":"2023-04-25","day_of_week_start":"Tuesday","day_of_week_end":"","text":"Meeting with Sandy after work. Decided to meet in Bordertown to see the sunset and walk in a small park. It was success. Walked for a little bit holdings hands. Did more or small talk and some nature observations. I think she is more open talking wise compared to the first or even the second date we had. She is kinda shy and doesn't know how to take compliments. After we got to return point we started making out, and did at least for 10 minutes. She really wanted it, and didn't want to stop. After got to parking lot, make up a little bit more. After that I asked if want to dinner after and we found a place. The dinner was nice as well. Luckily, I have enough stories to talk about. She bought the food and I will buy food next time. I definitely like it.\r\n\r\nAfter dinner maked out a lot a again. in the parking lot. Was able to grab some ass and tit. She didn't mind that at all. Both of use were excited at this point. Eventually she proposed to get to her place, I waited for her to say it first. Got some condoms on the way there just to be safe. She was wondering why I was late. We continued on, and she is kinda shy when it comes to her body. Kinda tried to cover her chest even when she was almost naked. She doesn't have too much experience according to her. I try to be as much as supportive to her. Tried to get in, but it was hurting, so I just let it be. Maybe next time. Cuddling was nice, I missed it and it was nice even though it was hard to sleep. Both of us enjoyed it. In the morning decided that didn't want to leave so soon, so next time I will sleep on Saturday and then do something fun next day.","tags":"dating"},{"id":43,"title":"Strenious backapaking","date_start":"2023-04-22","date_end":"2023-04-23","day_of_week_start":"Satrurday","day_of_week_end":"Sunday","text":"Decided to backapack 50 miles in 2 day\r\nfeel fine first 17 miles then not as great and slow down\r\nsaw a car stranded in the sand","tags":"hiking"},{"id":42,"title":"Second data success","date_start":"2023-04-20","date_end":"2023-04-20","day_of_week_start":"Thursday","day_of_week_end":"","text":"Second date with Sandy\r\n-orchid no time, but got them\r\n-walk in the park\r\n-found place under cherry trees\r\n-nice picknick\r\n-cheesecake and tea\r\n-asked what want in relationship\r\n-similar ideas\r\n-mission to hold hand\r\n-kinda akward the end went to a kiss kinda but didn't read it","tags":"dating"},{"id":41,"title":"Designer meeting with emojis","date_start":"2023-04-19","date_end":"2023-04-19","day_of_week_start":"Wednesday","day_of_week_end":"","text":"Another meeting with the designer. She wants to change a lot of things to look more apple like. I added emojis as pictures as she asked. However, when she emojis she meant not them but pictures instead. Definitely laughed about it.","tags":""},{"id":40,"title":"Photography after work","date_start":"2023-04-14","date_end":"2023-04-14","day_of_week_start":"Friday","day_of_week_end":"","text":"Went on a stroll on with my camera while everything is still blooming. Starting to go out after work to take pictures sine the weather got nicer. One of the favorite park near by where there is a lot of wild flowers. The new lens didn't disappoint as well. Macro photography is kinda hard because of shallow field of view. Don't really need low aperture in order to take macro photography pictures. Saw some flowers still blooming and found some additional flowers as well.","tags":"photography"},{"id":39,"title":"Second date this weekend","date_start":"2023-04-16","date_end":"2023-04-16","day_of_week_start":"Sunday","day_of_week_end":"","text":"Second date in this weekend, but with new person. I think I set my mind to a first person, but at least I will know more people and get some practice in my social skills","tags":"dating"},{"id":38,"title":"First date this weekend","date_start":"2023-04-15","date_end":"2023-04-15","day_of_week_start":"Saturday","day_of_week_end":"","text":"Back to dating. Been a while. Arrived there first, but she got the tickets. Waited in parking lot to, and the way I got her number. She is not too bad looking. Most of the time I was talking. I guess the practice at hiking worked out. Also, was able to share all the facts that I been learning about the nature.  She is kinda shy and not prompting any questions like I did. All the Not as assertive as I would like. Had to take a charge a bit to place to sit or when to leave the restaurant.  Maybe at the end of the data became more open to conversation. Did some jokes about me at the end. After  the lunch walked little bit more. I tried to see if she is open to holding hands, tried to get closer to her, but it don't think she was open to it. Overall had a great time. Enjoyed the park as well. At the end got a hug. She was not nervous but uncertain how to do prompt it. Next date is already planned for the next weekend which is a good sign.","tags":"dating"},{"id":37,"title":"Full front end now, more dating","date_start":"2023-04-13","date_end":"2023-04-13","day_of_week_start":"Thursday","day_of_week_end":"","text":"Got couple dates planned for the weekend. Something for the change. Spaced them out, probably won't be able to attend hiking.\r\n\r\nWorking with UI designer to improve my UI that I have built by myself. I am the only person on the team who is versed in CSS, so I am default person who is going to do it. I know some of the things that she is trying to improve.","tags":"work, dating"},{"id":36,"title":"Exploring cape may and local trains","date_start":"2023-04-09","date_end":"2023-04-09","day_of_week_start":"Sunday","day_of_week_end":"","text":"-Old trains \r\n-battery dying, glow stick\r\n-cape may \r\n-horse shoe crab\r\n-liked be at peace at the beach\r\n-messaged sandra bc she enjoys the beach\r\n-got too tired to go to wild wood, next time\r\n-found bunker on beach\r\n-some local coastal defense history\r\n-car crash on the way back\r\n-wanted to eat, but all was available was wawa","tags":"photography"},{"id":35,"title":"Anvar brought plov to hike","date_start":"2023-04-02","date_end":"2023-04-02","day_of_week_start":"Sunday","day_of_week_end":"","text":"Anvar organized a hike and brought some plov and food because celebration from this county. After he fed us, it was had to get moving again. Luckily Anvar decided to take a shorter route.\r\n\r\n Nastya was at the hike and it been a while since I have talked to her. She is still trying to get into tech. Does some leetcode, but not personal projects yet. It was nice catching up to her and see how she is progressing. \r\n\r\nNew lens for hike is kinda bulky and heavy, but I don't regret my decision. I still enjoy it too much and quality might be sharper. Taking pictures of dogs worked great and taking pictures of trees with low aperture makes things way easier. Also, might found white balance setting to make things less blue.\r\n\r\nSocially, I think getting better. it comes more naturally. Also, knowing some facts about the place such as local mines and glacier lakes made conversation more interesting. Should continue gathering such facts so can talk about. Also, taking pictures of signs helped a lot because they had an interesting information that I could share and reference.","tags":"hiking"},{"id":34,"title":"Call with family","date_start":"2023-04-01","date_end":"2023-04-01","day_of_week_start":"Saturday","day_of_week_end":"","text":"Call with babushka that mama organized. Almost missed because misinterpret time, but still got on the call.","tags":""},{"id":33,"title":"More testing new lens before cherry blosom dissapears","date_start":"2023-03-31","date_end":"2023-03-31","day_of_week_start":"Friday","day_of_week_end":"","text":"The time is ticking before all cherry blossom disappears, some of the cherry petals are already blowing away at some trees. However, it was the only day that I would be able to go because of the weather. The shoot was pretty. Low aperture really allows for some nice macro photography shots. I am really pleased with the purchase so far even thought it was a but pricy. Low light performance was a perfect as well. I never thought that low aperture would make such big change","tags":"photography"},{"id":32,"title":"Meeting the team and new lens","date_start":"2023-03-29","date_end":"2023-03-29","day_of_week_start":"Wednesday","day_of_week_end":"","text":"New lens have arrived today. I took it out for the spin after the work. I really enjoy the low aperture. It makes all the difference and brings different perspective.\r\n\r\nAfter that met with the rest of the team for dinner. The company was paying for it. The manager was in town too to talk to LM people. Hope that something comes out from it job prospects wise. It was nice socializing with new people and knowing what there look like.","tags":"work, photography"},{"id":31,"title":"Sandara even more inviting","date_start":"2023-03-27","date_end":"2023-03-27","day_of_week_start":"Monday","day_of_week_end":"","text":"Totally exhausted by the hike yesterday. The work was drag because of that. Sandra is be coming more inviting to a meeting. Wants to see fall colors together in Maine. I guess some slight flirting and wondering if I can come over just over the weekend. I had told her about the dream where I peed on her, but didn't give her all the details. She was doggy style and I peed on her while tried to stick in and she didn't notice it at all.","tags":"Sandra"},{"id":30,"title":"Snowshoeing for the first time","date_start":"2023-03-25","date_end":"2023-03-25","day_of_week_start":"Sinday","day_of_week_end":"","text":"First time show shoeing. It been telling myself three times already that it would be my last time hiking in snow, but I was wrong. Like a last time carpooled from North Jersey to Catskills. This time I went went with Anvar. As we got closer to the trail heard, there was more snow. At some point I was concerned that there won't be any snow. There was plenty of snow once we gained elevation. At some points it were couple feet. Started with microspikes because there weren't enough snow and transitioned to snow shoes once we started to fall through snow. Anvar decided not to take microspikes with him because he decided it too much too carry. He started with snow shoes, but had to take them off because there weren't enough snow. So he was struggling for grip at some points when he had to go uphill.\r\n\r\nThe first uphill was most intense for me. At some points I was really struggling and was wondering if bulking is even worth it. Being ~180 lbs has it own detriments when hiking. Once we gained elevation, we started to fall into snow and had to put snow shoes. It was different experience walking in them and I had to get used to it. Anvar fell a lot because he would step on his own snow shoes and trip. He was definitely struggling adjusting to them. Even we had small group most of people walked their own pace.\r\n\r\nBushwhacking was an interesting route. There were a lot of snow and it was supper steep. Even snow shoes didn't help to stay on top of snow at some points. The didn't help with grip either. Slid several times an landed on my butt several times as I was coming from steep hill. Once we approached our last incline I drank some red bull to get it over it. Anvar was really struggling with this uphill.\r\n\r\nAt the top we found a canister that we record our names. Yura is really knowledgeable about Catskills. He was telling about all crashed airplanes that people can find here. At the top we decided to take a shorted route and not to summit Mt rocky. It would be too much for us in terms of endurance and time wise. \r\n\r\nGoing back I started to get blisters. Most likely the way I attached my snow shoes. We had second lunch and I was able to access the situation. My socks and shoes were completely wet. The shoes are not as waterproof as they say they are. I applied leukotape and changed socks and continued on.\r\n\r\nAt the end I didnt feel as dead as last time I went hiking in winter here. My endurance might be improving after all. Just need to keep it up so I am ready for the backpacking trips.","tags":"hiking"},{"id":29,"title":"Distruptive presentation and work","date_start":"2023-03-19","date_end":"2023-03-22","day_of_week_start":"Monday","day_of_week_end":"Wednesday","text":"There was a big presentation this week in out work area. A lot of people came in to make sure that demo is going to work. On Monday disturbed too much of work because of the noise and people were working near by the work area. After lunch were not able to work at all, so we just talked for an hour. \r\n\r\nOn Tuesday we  decided to just work from home because it would be more preparation for the demo. It was nice working from home. Didn't need to drive anywhere and had a nice view from my window. On negative, didn't really have anyone to talk to. I think hybrid is the best of the both worlds.\r\n\r\nWednesday was a busy day. All presentations till about 1pm. Diffidently impacted the way we worked. Had to help Shawn with front end. He is definitely struggling with front end. Feel like front end is my domain knowledge for this project. Feel like I am midlevel Software engineer in this position.","tags":"work"},{"id":28,"title":"Anvar is back and hikes are back again","date_start":"2023-03-18","date_end":"2023-03-18","day_of_week_start":"Sunday","day_of_week_end":"","text":"I was thinking going to Cape May to take pictures this Sunday. Dimka didn't organize hike because new WoW patch just dropped and he was busy with that. Anvar recently just came back from traveling and was wondering if there is any hikes this weekend. He just decided to organize his own since there were none. So I have decided to join him instead of photography trip. Dimka has decided to stay home and play WoW.\r\n\r\nThe place that we went I had been there before. Had some small talk with people who I am never talked to. I guess I am getting better at it. The talk about the weather can work. The weather was not too bad, but just too windy, it blew all the heat away from me. Realized that I didn't have my gloves with me, but I knew if I keep moving, my hands would be warm. And it worked in the end. They were in my rain jacket, and I found them when I was putting on out lunch break. \r\n\r\nAll my camera batteries were all dead for the most part. Should have charge them after every hike. Luckily was able to use power bank to charge it.\r\n\r\nIn the begging of the hike was walking in the back. The disadvantage of this trail was that it was a single track  trail. Not a big chance to communicate/talk with other people. Wanted to talk with Anvar since I haven't seen him in a while, bu he was several people ahead of me. Eventually, was able to catch up with him. I tried to take pictures of Anvar's dogs, but they were moving too much. Trying new things with camera setting( white balance), let see how it turns out. Some people were from older and were talking how thing s were in Soviet Union regards concerts and their restrictions.\r\n\r\nAlmost fell town couple times on the way back because of rock and was feeling a bit tired even though we only hiked for 3 miles. But it felt more than that to me. \r\n\r\nSecond hike was also interesting. Ruslan and Tanya decided to join us as well for a change. It was nice seeing them again. I guess Dimka is missing out seeing Ruslan in person. It was nice to catch up with him and what he been up to. There were some nice views on the hike. I don't think that Tanya enjoyed  the hike that much. The was not feeling at the end of it. Learned that one person almost got lost here when they were doing sunrise hike. She went to wrong direction. \r\n\r\nHad to do some bushwhacking because we went on the the trail that is not trail,  but looked like a trail. All we had to do is go 5 minutes through woods to finds the trail. We had to do it once more. I don't think Anvar is that great with directions outdoors. At the end of the hike I was feeling it. My endurance went to almost 0 at the end of the hike.\r\n\r\nAt the end of the hike Ruslan invited to for dinner after the hike. Was sitting in the car while got the call. Was contemplating in the begging, my head wasn't working correctly after the hike. Decided to join. It was nice chat catching up and seeing their new place","tags":"hikinng"},{"id":27,"title":"Unlicky ones with remore work","date_start":"2023-03-15","date_end":"2023-03-15","day_of_week_start":"Wednesday","day_of_week_end":"","text":"There is going to be a presentation at out area next week. Avinash and I got unlucky and got selected to be a placeholders for the area. The rest of the team had a chance to work from home.\r\n\r\nHad kinda an awkward interaction at work today. Say my former manager. Chat a bit, but I managed trough it. First time for me in this situation for sure.","tags":"working"},{"id":26,"title":"Local hike for a change","date_start":"2023-03-11","date_end":"2023-03-11","day_of_week_start":"Sunday","day_of_week_end":"","text":"No one signed on hike on Sunday, so Dimka and I are doing a local hike in Pinelands. We are doing the red route in Franklin Parker preserve. The route didn't disappoint at all. Probable one of the best routes at that park. It has some variety of scenery. Has bods, forests, swamps, cedar groves. Luckily the ticks are not here yet so was able to take some pictures that would be afraid to take during the summer. Finally found that spot with large wooden chairs that say on Sveta's story. At the end of the hike was family asked how to get to the most those chairs and steel rope bridge. Finally found a railroad bridge over a creek in the forest.","tags":"hiking"},{"id":25,"title":"Job role defined, some conflicts","date_start":"2023-03-10","date_end":"2023-03-10","day_of_week_start":"Friday","day_of_week_end":"","text":"My job scope of my project is set for sure. Doing front end in React till the remainder of the project for sure. From the group I am most versed in front end even though my never worked in front end professionally. My personal projects covered the majority of the project scope. Still remember React and CSS. Patric even asks questions about it how to do it. I know how to do it, just I am busy with other ticket. The new thing that I am learning from this experience is TypeScript. It had been a bane of my existence in this project. Gives a lot of roadblocks compared if I just used vanilla JavaScript. However, I see benefit of type checking. I am warming up to it, and it definitely helps me with passing correct data and helping avoid mistakes. I treat this project 6 month  as a react boot camp. Definitely not interesting in Spring boot as back end technology. XML not fun to configure. Maybe learn Node js since been working a lot with TypeScript.\r\n\r\nTed has definitely a short temper. He is being visibly frustrated  and upset that he is ticket has no progress. He was even banging a little on the table even when the admiral was here. We were discussing it it Evan and Avinash about it. Ted even called us cocksuckers for not switching ownership of closed area right away. We discussed that as well.","tags":"work"},{"id":24,"title":"Still trying to date","date_start":"2023-03-08","date_end":"2023-03-08","day_of_week_start":"Wednesday","day_of_week_end":"","text":"Still no success with dating on Hinge. Talking to one person. She seen nice and we have things in common. Similar music taste and interesting is outdoors. She wants start with backpacking more. Had some long conversation. However, it have been several weeks where she didn't want to meet in person. Said that she will let me know when to meet, but never followed up on it. I got her instagram and we are talking through it now. Hopefully will link up with her soon. My fears for her profile pictures on Hinge weren't too bad. She used a lot of filters on her dating profile, but she doesn't look so bad on her instagram. Might have a kid looking from posts, but dating profile says that she doesn't","tags":"dating"},{"id":23,"title":"People got scared because of weather hike","date_start":"2023-03-04","date_end":"2023-03-04","day_of_week_start":"Wednesday","day_of_week_end":"","text":"Organized hike for bear Mountain NY since Dimka has drill this weekend and Anvar still on travel. Didn't really check weather prior making the event. I was supposed to rain in the morning of the hike and day prior, so some people were conserved coming or not. However, the weather was perfect. It wasn't raining or snowing at all. The only people showed up are Sergey and Nadia, and one more person decides to come last minute. We waited her in the hotel lobby.\r\n\r\nThe adventure begin pretty much in the beginning. There was a lot of snow on the side of mountain where the trail was. It was a lot of slush snow it was really slippery. We were slightly concerned that the entire trail is going to be like that. I event thought of making a shortcut and going 2-3 miles less than been planned. However, as we went on top, the other side of mountain didnt have as much snow and it was pretty passable. The initial trail was on north side and had big valley in front of it. I guess that this mountain stopped all snow coming over the mountain. The view was nice at the top. It is all I wanted. Low mountain really hid the ugly bold mountains.Took pictures of nice view from there. Had lunch there as well. It was a nice break, and we didn't want to move at all. Going down started to be sunny for a change, and we had to loose even more layers. I remembered spots where I filtered some water and the road I took then I did my section hike. After going downhill it was all forest now. A lot of trail was flooded, and my shoes definitely got wet. \r\n\r\nPart of the trail we waled was where British solders walked in 1777 when they attacked local fort. It was an interesting part of history. After I realized that there is not as much snow anymore, I realized that we can prolonged out hike slightly. We did some loops to get some extra miles. The abandoned village was pretty nice to visit as well. read a history about it. It was a miner village, they had couple schoolhouses and a church and about 300 people living there. The state wanted to expand the park and bought up the neighboring lands. However, family still owns a plot of land there that is used as an active cemetery. It was cool to visit is as well. The ruins that I saw at the map looked like some water treatment plant. Unfortunately it was fenced off and was fenced by bushed and I was with other people. Would diffidently try to explore it if I went by myself.\r\n\r\nConversations wise it was more small talk, but I have tried to ask more open ended questions to a new member of a group. It worked, and should continue it during the hikes.\r\n\r\nChecked radiator cap again. There is still some hard crust on radiator cap again. It is harder compered the first time I saw it. The oil and coolant still looks fine and correct color. I guess that there is no head gasket leak as I was worried about. Still might try to get new car probably after current project is over when I will know that my next job/how long project is going to be or wait till something breaks breaks. Looking at market the price of car ~30K and not everything is available. Might get Crosstreck because it more like a car and not a SUV.","tags":"hike, car"},{"id":22,"title":"Blue lakes hike second time","date_start":"2023-02-26","date_end":"2023-02-26","day_of_week_start":"Sunday","day_of_week_end":"","text":"Hiking to Buttermilk and Crater lake again. However, we parked at the bigger parking lot. The road to original parking lot was closed anyways. We had relatively big group this time. About 20 people showed up. I knew at least most of them. Lisa, my date from from Hinge, showed up as well. The funny thing happened that another person from hike knew her as when she was a child. However, Lisa didn't recognize her at first and she was shocked to to see someone that knew her. It was made a funny information from it. \r\n\r\nIt snowed the day before and it was nice that there was some snow on the ground. Looks way better  compared to just empty ground. Additionally , the fog from the snow was still in there. It hid some of the bald mountains. There was a frost on the trees and and pine needles. Crater lake looked even more beautiful, but waterfall was slightly dried.\r\n\r\nI was in charge of leading the group again since I made a route. Compared to last time, we only turned in wrong was only twice. The one time we were 10 meters away from the correct turn. The second time was deciding if turn left or right on intersection. GPS doesn't show where to torn on the crossroads and map didn't have the trail that we eventually took.\r\n\r\nHad better social interactions with all the people. Talked about half of the group, and had some interesting conversations. I guess better that regular with talking wit people. Definitely should continue this trend. \r\n\r\nRoma brought his roommate to the hike. Nadia said that they are not roommates, but that they are dating. They were close to each other at the hike, and by the end of the hike they were holding hands already.","tags":"hiking"},{"id":21,"title":"No more drill, react developer","date_start":"2023-02-23","date_end":"2023-02-23","day_of_week_start":"Thursday","day_of_week_end":"","text":"Asked Noel if I really need to be in the upcoming comex. I already turned in my gear and it would be my last drill anyways. Luckily for me, I was to that I don't have to go. It would be nice not to be at drill during the week day. I won't miss any work/loose money because of the drill.\r\n\r\nGetting in a specific role at my work. Now I am a doing front end for the most with React, something I am comfortable with. Java Spring Boot doesn't excite me at all. Still remember how to do CSS though.The only thing that kicking my butt is TypeScript.","tags":"work, army"},{"id":20,"title":"Revisiting Hickory Run","date_start":"2023-02-19","date_end":"2023-02-19","day_of_week_start":"Sunday","day_of_week_end":"","text":"Revisiting Hickory Run State Park. I been there by myself year ago, but now I have to lead hiking group. Since I been here before with camera by by myself I had time to get all the picturesque places. Still was able to capture different viewpoints since there was some ice and my photography skills might have gotten better. The rail was pretty much as the last time I was there, but going to overlook where the bridge was. Everyone seen to enjoy the views since it was near creek for the most part. Once we went uphill is where people started to slow down. However, the view was worth it. The woods were almost the same as on other hill that I visited here. A lot of stand alone trees and shrubs and tall grass. I don't think I will need to go to other trail since it is going to look the same. We finally arrived to the overlook, and people were happy to finally rest. They been asking when  is the stop since we hiked about 5-6 miles at that point.\r\n\r\nThere is a definitely a downside leading a group. Had to be in front of everyone and have little chance to interact with other people. I let other people in front of me and told them I would let them know if they in the wrong path.\r\n\r\nThe rest was really nice, and everyone seen to enjoy it. Poke fun of Diana that we are going to gift her a backpack since she asked Dimka to carry some of her things. Gift her a cup since she wanted by tea, but didn't have it or any place she can put it. Enjoyed my seat pad as well since I don't have access to poncho liner. Still going to work if I something happens and I need to stay in woods for a bit. Backpack can a serve as sleep padding as well. So I think I am ready for spending night in the woods if something happens unless it is too cold.\r\n\r\nGoing back turned wrong places couple times. People who went in front of us missed a turn and continued forwards. Had to whistle to get their attention. Another guy decided to take a leek on the trail that we missed. Turned too soon because and had to backtrack for couple minutes, but saw a trail in few minutes. Also., in the beginning went of train where I thought the trail was. We just climbed a hill and saw a trail. The GPS showed that we were trail, so I got confused about the directions. \r\n\r\nAt the end of hike we wanted to get some food. However, there is were not many places to eat. The first place that we went was just a bar that serves food. Additionally, smoking inside was allowed, so we decided to go somewhere else. Diana was adamant on getting Indian food even though it was located inside a gas station in middle of nowhere. The place had small cosmetic defects, but food was alright. It looked kinda like a gas station, but better. Sveta and her group decided to go somewhere else since the place was too downscale and they wanted to sit down somewhere nice, but Diana wanted to get some food. I think I saw a cocorach as some point coming out from garbage bin...so not sure if want to visit again.","tags":"hiking"},{"id":19,"title":"Moorestown Photography","date_start":"2023-02-18","date_end":"2023-02-18","day_of_week_start":"Staturday","day_of_week_end":"","text":"Had some free time and decided to do some local photography. It was 3 day weekend and I had a chance for street photography. I am still struggling with that to some extent. On of the options was to go to cape may, but it was too far away, and would take too long to drive. The downtown was pretty small, but I still got some decent shots. Then walked around the  residential area. It was pretty interesting place. A lot of older buildings closely packed together. Also, the near railroad left a mark on housing as well. Some of the houses looked that they were where railroad workers and working class peopel used to live.","tags":"photography"},{"id":18,"title":"First Hinge data","date_start":"2023-02-16","date_end":"2023-02-16","day_of_week_start":"Thursday","day_of_week_end":"","text":"Going to first Hinge date. Almost got cancelled because of the rain. However, I was kinda persistent that we meet. One of the original plans was to go there by underground, so I drove there. Philly looks pretty cool. I would definitely visit it to get pictures of older building and architecture. The date was alright. More small talk and getting each other. Probably need to start asking questions with more substance. Something about the future and goals. She is pretty chubby, so that was a no for me, at least she is nice person. I was trying to overlook her appearance as the date went on. We had a dinner and scattered to our ways","tags":"date"},{"id":17,"title":"Home station drill...getting closer","date_start":"2023-02-09","date_end":"2023-02-12","day_of_week_start":"Thursday","day_of_week_end":"Sunday","text":"my days with guard is getting closer to the end. This drill is staying behind so that I can turn in my gear and help with supply. Thursday helped with loading gear for people that were going to the field. Got my award for COVID mission. People were confused since it was Air Force medal.  Sat in the vault, and supply sergeant thought that I was hiding since I was supposed to do something even though he told me nothing about it. We were to check radios, but all the batteries were dead. We just waited for them to be charged. Other supply sergeant came by to told us what to do. We were mostly waiting to be released at some point. We got told that we need to pick up gov from fort Dix. The other guy and I were confused about it since we no one told it about it. There were a lot of confusion about. Apparently it was task that were supposed to do, but no one told us about. We were confused and annoyed about it for sure. Our time is not being valued at all. Wix came in to get us with the van. In the process he had to cut one of the lock to get a whiteboard for his section. Luckily, all we had to do was to pick vehicle and bring it to the armory, didn't have to stay in the field. Still got back home around 2300 because of this stupid and late task\r\n\r\nI turned all my gear, and didn't have anything missing surprisingly. Supply sergeant tried to scare me with what happens if I am missing some gear. He was gone for the most of the day, and I just chilled with supply people for the most of the day doing nothing while recon people were working in the vault. Don't feel bad about shaming at all. I been working hard, plus I don't have much care in the world. It is interesting how different people perceive you. I am mostly smart and hard working with people I work with, but with new group of people I don't have such privilege. Once supply sergeant came back, I joined people in the vault to clean the weapons. At the end of the drill there were thinking that I am supply person. I guess I give that vibe since I was able to talk with supply people freely. \r\n\r\nThe last days of the drill was all just cleaning weapons and receiving weapons in the vault. It was a nice hidy hole from all moving around when people came from the field. Saturday we stayed in the armory overnight. Because higher ups didn't want anyone to leave since super bowl was the next day. Sleeping in the cot wasn't as comfortable as it used to. I guess I got bigger because of the bulking. It felt slightly narrower than it is usually. Even Jimenez said that my back is looking wider now. \r\n\r\nMendilo was locked in the vault in over night. He set up his cot there. Some one overnight closet the vault door and spinned the combo. He was able to open it from inside and get out. However, they need to to figure out how to set vault door into state that would allow them it to close back. It wouldn't close. Supply sergeant wasn't happy about it since he thought that he would need to dispatch a vault person in order to fix the vault. We got released early because of Superbowl, but I didn't care about it. All I wanted to to be as far as possible from the army.","tags":"guard"},{"id":16,"title":"Snowy hike in Catskills","date_start":"2023-02-04","date_end":"2023-02-04","day_of_week_start":"Sunday","day_of_week_end":"Sunday","text":"Hike in snow for the first time. Got some microspickes just in case just for this hike. Luckily Nastya agreed to do carpool. Gave her cookies just for her for all her hard work. She seem to appreciate it. All I had to do is to drive to her and then she would drive Anvar and I to the trail head. the only bad part about this hike was that it was on Sunday, the work is next day, and that had to wake up at 4 am in order to be on trail on time. On the way there we discussed out outdoor plans and more of the regular small talk. \r\nThe weather was perfect for the hike. Not too cold even if not moving for a short while. I dialed in my layering system for winter hiking. For ~35F all I need base layer, waffles, and a hiking shirt. Rolling sleeves up and down serves a great way to thermoregulate. \r\nAt the beginning of the hike we decided not to wear microspikes since we didn't see any ice. However, not ever 5 minutes in there was an ice sheet on the trail. So all of us had to put them on. Seat pad came in handy. It came in handy during lunch. More practical than poncho liner if I just want to sit down.  I didn't have to put microspikes standing up and be in danger of falling. It was a different sensation wearing microspikes. I didn't feel like I am walking on ice at all. Really enjoyed hiking in snow since all the rocks are covered in snow so don't feel. There is less rock scrambling since snow made trail smooth and made rock scrambling not as tall. \r\nSome parts of the trail looked like they were from fairy tale. The snow looked really beautiful at tree. Having everything covered in snow makes everything more beautiful compared to barren forest. \r\nThe second part of the hike is where I started struggling a bit. We had to go up to move hilltops. However, my legs were not having it. I didn't have enough endurance to keep up to everyone. At some points quads almost started to cramp if I tried to step up somewhere high such as rock. Still not regretting doing legs yesterday. Felt slightly dehydrated at some point as well. The electrolytes the day prior didn't help as much I wanted. Last uphill was most difficult because it felt endless. there were multiple hilltops before the final one. But I have managed to go there no problem just slower than the rest of the group. On the way on top saw where we backpacked Encampment trail in the fall. Everything looks so different now. After the top it was all downhill literally. The sun was perfect as well since the sun was setting. Kinda felt behind because was getting shots of the the best light possible. We ended the hike just perfectly right before it got dark.\r\nAs usually we got something to eat after a long hike. Luckily there is a lot of places for that. Some small talk and what is the best town to live in norther jersey. I was beat from the hike and was feeling excused because of early wake up time. On the way back talked a bit with Nastya. She is alright, but has kids. Before drove home stooped to get some energy drink to be safe. The worst part about it is that I have work the next day.","tags":"hike"},{"id":15,"title":"Phone date","date_start":"2023-02-04","date_end":"2023-02-04","day_of_week_start":"Saturday","day_of_week_end":"Saturday","text":"Had a phone date today. Already found several matched on Hinge. Should have downloaded this app earlier might have met someone already. Mostly doing filtering for people who is are outdoorsy because it is what I am looking for. Overall had a nice conversation. A lot of it circle back on hiking and outdoors stories. Something I am looking towards. Talked for about 47 minutes. Hopefully going to meet in person soon. Too bad that have this drill in the way...again. She speaks Russian which is plus. Invited her to our hiking group as well so she can join. It would work the best if things work out.","tags":"date"},{"id":14,"title":"Improvized hike","date_start":"2023-01-28","date_end":"2023-01-28","day_of_week_start":"Saturday","day_of_week_end":"","text":"This hike I made a route just looking at the map and looking where trail/road is.  There wasn't street view and the parking lot that wanted to park wasn't even in the Goolge maps. Diana asked if even it was correct parking lot since she was concerned if it correct parking lot. On the way there we took more scenic route. One of the roads was closed so we had to turn around and go by the detour. Original road was blocked by cylinder blocks. We turned around and got on detour route. The road was pretty bad, a lot of potholes. Wish that have taken route that approached park from other side. \r\n\r\nThe road for parking lot was closed as well. Luckily we have found another parking lot near by. Found another person from out group there. Other people came from other side and I have to send people where we parked. Luckily  it wasn't too big of detour for other people that came from other side. This parking was actually better than the original planned one. We started from cemetery and the start of the creek.\r\n\r\nThe hike was pretty nice especially in the beginning. A lot of water in the begging. Additionally, the sun was just rising so lighting was almost perfect. However, on the way back there was overcast, and not a great light. There was some snow as well, so it was nice seeing it for the first time this year. Passed by shelter that I stayed when I backpacked by there. Missed turn to Appalachian trail. Had to backtrack just few minutes. Realized that we are going too much downhill. After that we were back to Appalachian trail. It was just regular trail. A lot of up and downs and rocks. Walked a a little bit more than planned since started in other parking lot. Dimka seem little bit annoyed that we walked a little bit more. \r\n\r\nFor the most of the hike we had a lot small talk for the most part. The small talk continued to the restaurant as well.","tags":"hike"},{"id":13,"title":"Lucky Drill","date_start":"2023-01-27","date_end":"2023-01-29","day_of_week_start":"Friday","day_of_week_end":"Sunday","text":"Another drill. Can't wait to finish everything and be free. Got lucky with drill this time. Didn't have to go to the field, because there was something to do in the armory. We were setting up tents and setting mobile TOC set up in the back of FMTV.  Since we stayed back we weren't sure how we go to the field as well. The bus left, and there weren't any tactical vehicles we can drive there. The first and second day we were still not done with the task. Everyone were happy that we didn't have to be in fort Dix. Vanessa came back from the field, but she stayed with us as well even though she was supposed to grab extra parts from armory. It was nice to have home station drill. It was nice sleeping in my bed and eating real food.\r\n\r\nCommand sergeant major thinks highly of me. I guess I give out the vibe that I know what I am talking about. Just need to be confident what I am talking about and have more information than other people. Being in for 8 years, gave me a lot of random knowledge and random skill that other people might not have. Other people think the same way about it me as well. Additionally other people think that I live in the forest as well.\r\n\r\nWe were cleaning out garage, and I found some free stuff that I could take home. Put everything into a milk carton and take it out when no one was outside. Got a survival blanket that I wanted to buy, and med kit that I can put into my car. \r\n\r\nTovarish tried to shame me for buying car from his work. Like my car is a old and a junk and that I spend a lot of money maintaining it. However, I shut him up saying that my yearly maintenance is cheaper that car payments.\r\n\r\nSandra call me as well since it was my bday. She diffidently doesn't mind getting together. Asking when I will come over or when I will buy ticket for her so that she can come over as well.","tags":"army, Sandra"},{"id":12,"title":"Work upgrade","date_start":"2023-01-16","date_end":"2023-01-26","day_of_week_start":"Monday","day_of_week_end":"Thursday","text":"Started new work this week. Finally broke into a six figure salary range. First few day were just were just onboarding and setting all the accounts. Security was the pain in ass for the majority of the week. We needed to get appointments to get our contractor badges. The day we had our appointment, the camera to take picture was not connected to security laptop. So we just took pictures and write down what we were wearing during out pictures. The next day that we went the pictures were still not ready, the camera cable was broken and were asked to email picture to security. We were asked to send pictures of our selves to email. However, we can't take any pictures inside of facility to do it. Luckily we were able to get help from some people. They gave security some hardware to transfer pictures from camera to computer, but it took about five minutes for each picture to transfer. At least we are able to get our regular badges now. The next step was to get me an access to closed area. My pin haven't worked right away.\r\n\r\nHad a small scare with my job. Was not able to log in to my account for even on Tuesday. On Tuesday, still wasn't access my primary work email. Talked to Ted, a guy from same company, and decided to contact hr/it. Wasn't not sure what that about since I need to input my time sheets as well. Was worried that was out of the job. At the end, the password that I was provided was wrong.  After talking to HR I was able to get my accounts. On a positive note, since there is a time difference from support, the main office is in San Diego, I was able to contact them after my work hours and get support that I needed.\r\n\r\nThe job is general is not so bad so far. We are recreating application from scratch and using all modern technologies, React, kubernets, AWS. Would be a good importunity to learn relevant technologies. First week is just all planning.","tags":"work"},{"id":11,"title":"Local photography trip","date_start":"2023-01-15","date_end":"2023-01-15","day_of_week_start":"Sunday","day_of_week_end":"","text":"Finally decided to get of the house to explore the area. Didn't feel like going before lunch, but after it had some energy to go out. Additionally, overcast was finally over, so better sky for photography.   Previously had a plan to visit Mt Holly. It has a park that I wanted to explore. The park had some old buildings as well  buildings that are not kept in the best conditions. My favorite part of street photography. The focal length of my lens is perfect for street photography. I hiking I it is more wider, ~ 23mm and street 33mm. Don't think I need prime lens that much. Cant really use low f stop when it is during daylight when it is too bright. The shutter speed in my camera is not fast enough for bright light. \r\n\r\nVisited a cemetery for photography as well. Was walking on a trail first and then went uphill where I was not trail. the cemetery was pretty old, and I was able to get some interesting shots. Continued on trail and saw some interesting graffiti as well. The bridge was closed at one point, but there was a trail around it. The only point I wanted more zoom in my camera when the place was closed and I didn't want to trespass. It had some interesting train cabin. \r\n\r\nVisited \"down town\" of Mt Holly. It was desolate with not many people walking, but at least buildings looked nice. Looked as old city town centers in midwest. The city has a lot of older buildings that are close together and without garages. Definitely working class people live here.  Some buildings are not kept in the best conditions. At least city is walk able more or less. Not sure if I want to live without garage of older house.\r\n\r\nDimka had his date. He said that she doesn't know what she wants. i told him that she should have a checklist of what attributes she is looking at her partner.","tags":"photography"},{"id":10,"title":"Early birthday","date_start":"2023-01-14","date_end":"2023-01-14","day_of_week_start":"Saturday","day_of_week_end":"","text":"Celebrating my birthday earlier since I have drill when my actual birth day is going to be. Good for me Dimka invited people initially two weeks ago. I didn't have access to phone to invite people at work to invite people. Additionally, invited Anvar to the group. It was good idea to invite him since we go hiking a lot in general and see him pretty much every weekend. Overall, it went pretty well with a lot of jokes and socializing.\r\n\r\nAs usually, we started with Black Run Preserve and food from Whole Foods. It was way colder that we expected. Talked most the time we were there, and went almost the same route as last time. Saw the abandoned car again. Joked that it has penis drawn now. Jokes has become more inappropriate  compared to last time we met. Talked about relationships a bit as well. Yana is going to dates, but she expects too  much and want guys to guess how is she is feeling. \r\n\r\nDinner was nice as well. Kinda ate too much food, and was supper stuffed at the end. More socializing and joking at the table. Overall good vibes. Roma brought his cake, and it was delicious as always. Played couple songs to people and showed home gym and my helmet. People were interested in them, but for me it was daily occurrence. \r\n\r\nAt the end Diana and Anvar left, and rest of us played some board games a bit and continued talking.","tags":"hiking"},{"id":9,"title":"Unpaid vacation started","date_start":"2023-01-10","date_end":"2023-01-16","day_of_week_start":"Tuesday","day_of_week_end":"","text":"Finally enjoying some free time where I don't have to do  anything at all. However, it is unpaid and I am loosing $1k a week which is price of really nice camera lens. I will think that break with doing nothing is going to be good for my mental health. I can work on deploying journal application as well.\r\n\r\nWent to see ruins of brick factory. It is something I wanted to do. It is not too far away, but it is only just ruins. It was pretty mid, but I glad that I was able to see them. Too much sprayed paint and trash. Additionally, there was a lot of overcast, so the sky in the pictures might be not pretty. Used phone camera just in case  because it has better hdr processing.\r\n\r\nGot phone call from my previous job. Have to sign something from security. They weren't in the office the Friday that I came in. I guess I wasn't that free. All I had to give them is my signature for NDA that's about it.","tags":"hiking, work"},{"id":8,"title":"Long hike","date_start":"2023-01-08","date_end":"2023-01-08","day_of_week_start":"Sunday","day_of_week_end":"","text":"Another long hike. Going to a pavilion that where went backpacking before. Nurila joined us this time, and she picked me up. She haven't been hiking for a while. Most of the way there were had a lot of small talk and talk about technology field. Eric forgot my name since I don't use my real name on IG. He thought my name is Slava. Talked for the majority way there. We arrived last, but people  joked that they only waited for us because I bring baked goods for hikes. \r\n\r\nWe had steep uphill right away. Nurila was struggling right away since she haven't hiked in a longtime. Waited for her several times. Additionally, she wore wrong jacket. She was wearing really bulky ski jacket. I had to give my yellow vest.However, once we got to the top at fire tower she was able to catch up with us and walk with main group.  After the uphill it was mostly flat or downhill. Had a lunch in the pavilion since it is the only open area. We used a bench as a table and set up table with what people what have brought. Almost people brought insulated bottle with tea with them.\r\n\r\nOn the way back had to find a correct turn. Used map and compass to estimate where to make a turn. It was fun, and found the right way.  As we went more down, we saw more moss and creeks. I took some pictures of that. Nurila felt down when running and she felt forwards. Her leg got caught by a branch. Luckily there weren't any rocks in the ground.\r\n\r\nFond a cabin middle of nowhere. It was lived in with kitchen and bbq stand. At one point we had a choice to go back uphill to fire tower or go to lake. we decided to go to lake since it would be shorter, but most importantly it had nicer views.\r\n\r\nAfter hike some of us decided to get dinner. The place was two minutes away across the road. The first place that we went was just a bar, and we turned around and went to place that I have been here previously. Had a nice chat and went back home. Nurila asked me to drive back since she was exhausted.","tags":"hiking"},{"id":7,"title":"Sandra is chubby","date_start":"2023-01-07","date_end":"2023-01-07","day_of_week_start":"Saturday","day_of_week_end":"","text":"Got call from Sandra again. She is doing fine, just got chubby. She asked me about it, and I told her the truth. At least she is aware about and wants to do something about it. But I am doubtful that she is going to get to her goal. She doesn't mind her coming over if I buy her a ticket, but I might wait till she is looses some weight before hand that. Other than that she is doing the same. Also, want to move from Cali so that she is able to buy house with some land. Find new work when she is done with her masters.","tags":"Sandra"},{"id":6,"title":"Dobbie is freee","date_start":"2023-01-04","date_end":"2023-01-06","day_of_week_start":"Wednesday","day_of_week_end":"Friday","text":"Last days with the company. People found that I am leaving on my last day. A lot of them congratulated me of moving on. Drew wasn't too happy about it since he is already at the edge dealing with the things that he has to do especially that Top is leaving as well. Kaitlyn facepalmed when I said that I am leaving since Adam is leaving as well and she is going going to be totally by herself.\r\n\r\nExit interview was kinda awkward since no one was prepared for me turn in my things. Had to wait in lobby for a little bit to figure things out. HR was kinda condescending that I am leaving the company ans giving a short notice. Asking why I didn't give two week notice and that people are going to be short staffed. General idea that I clearly don't care.","tags":"work"},{"id":5,"title":"One week notice","date_start":"2023-01-03","date_end":"2023-01-03","day_of_week_start":"Tuesday","day_of_week_end":"","text":"Got email back that I am able to start my new earlier. Not thinking how much notice should I give. At the end this is going to be my last week. Tom is also leaving the company for somewhere else. A lot of people are leaving for some reason. I wounder why. We talked about him leaving in a small group, but I haven't told anyone that I will be leaving really soon as well. Got my notice to manager as well. On a funny side, a lot of charge numbers are gone because of new year because contracts didn't renew in time.","tags":"work"},{"id":4,"title":"Well travelled trail with a twist","date_start":"2023-01-02","date_end":"2023-01-02","day_of_week_start":"Monday","day_of_week_end":"","text":"Hiking Mt Minsi again. It have been most traveled hike for us. We had about 16 people showed up. However, I knew most of them. It was nice to hike with people who you know. Able to talk with a lot of people. Talked with everyone for the most part. A lot of small talk and catching up with people. People brought food and champagne to celebrate New Years. Had 5 bottles of champagne to drink. Reminds me a lot of my time in college where we brought drinks for a hike. Cheese cake was nice again. People seen to enjoy it. Still need to practice of recipe for only one cheesecake. In the second stop, I used woobie as a table cloth on the second drinking/lunch stop. \r\n\r\nOn the way back we took the different way that got here. It was surprisingly nice since there was a nice waterfall with some ice. Unfortunately the sun was facing wrong direction so that the sun was blown out. On camera pictures. Additionally, a lot of things were slippery, and I even slipped on my back. Too good for me by backpack with a lot/extra things soften the fall. Nastya D asked me why I didn't bring guitar with me since it would be perfect for it. Nice lunch and live music. No one decided to go for dinner afterwards since we ate a lot during our break. However, stopped at McDonald for some food and coffee. I was kinda tired, and coffee helped. About hour after I got home I just felt asleep.","tags":"hiking"},{"id":3,"title":"Think when start new work","date_start":"2023-01-01","date_end":"2023-01-01","day_of_week_start":"Sunday","day_of_week_end":"","text":"Thinking when should actually start new work. Looked again at drill schedule and I might be able to start week or two weeks earlier. Thinking about the loss of income if I take too long of a break. My week worth is at least $1k. Not sure how much is free time I want since can get lens  for the time I work. Might contact hr if I can start earlier\r\n\r\nWent to a smaller part around here. Finally saw that alien looking building. The part was way bigger that I expected. \r\n\r\nGot a call from Sandra after I messaged her about her trip to Nor Cal. She dropped her phone into hot tub when I can a call","tags":"work Sandra"},{"id":2,"title":"from local","date_start":"2022-12-29","date_end":"2022-12-29","day_of_week_start":"Thursday","day_of_week_end":"","text":"from locall","tags":""},{"id":1,"title":"from GCP","date_start":"2022-12-29","date_end":"2022-12-29","day_of_week_start":"Thursday","day_of_week_end":"","text":"GCP","tags":""}]